{
  "page": 1,
  "page_count": 18531,
  "items_per_page": 20,
  "took": 12,
  "timed_out": false,
  "total": 370601,
  "results": [
    {
      "contents": "<p>Everything we do at Sunrun is driven by a determination to transform the way we power our lives. We know that starts at the individual employee level. We strive to foster an environment you can thrive in through our commitment to diversity, inclusion and belonging.<br><br><b><b>Overview </b></b><br><br>The Site Survey Technician role is responsible for performing all site surveys on upcoming projects. Site surveyors have the opportunity to partner with several teams within the company as the Site Technicians are required on all projects and provide the Design and Engineering group the required information to accurately build and permit the project plans for solar installation.<br><br>Learn more <a href=\"\\&quot;https://vocalvideo.com/v/sunrun-employee-testimonials-steven-tech\\&quot;\" rel=\"noopener noreferrer\">HERE</a> from Steven, a Site Survey Technician. Steven enjoys the challenge of each job because no two houses are the same, and he gets excited to come to work because his team and leaders are always willing to help!<br><br><b><b>Duties and Responsibilities</b></b><br><br><ul><li>Perform site survey appointments as scheduled, collecting site information, taking clear photos and preparing packages for downstream teams and taking action as appropriate to keep the project pipeline moving</li><li>Provide detailed information regarding structural and electrical systems, roof quality and measurements</li><li>Must become Federal Aviation Administration (FAA) Part 107 licensed and trained to safely perform sUAS (drone) operations in residential areas that are FAA approved for flight</li><li>Build a positive customer experience through integrity and discussing project details and documenting or raising any concerns as appropriate</li><li>Use software systems to record progress of various tasks in a timely manner</li><li>Support the branch admin team with organization as it pertains to Site Survey objectives</li><li>May support other fuctions (e.g. Inspections and Permitting)</li></ul><br><b><b>Qualifications/How You Will Be Successful</b></b><br><br><ul><li>Minimum of 1 year previous field construction experience is helpful</li><li>Must be 21 years of age, possess a valid driver's license and maintain a clean driving record with the ability to pass a driving background check</li><li>Within 90 days of employment, must pass the FAA Part 107 knowledge exam and acquire a Remote Pilot rating for sUAS commercial operations</li><li>Drone experience and/or remote pilot rating for sUAS commercial operations is preferred</li><li>Ability to communicate with customers in a courteous and professional manner</li><li>Must be a motivated great teammate, looking to succeed with excellent verbal and written communication skills, organizational and time management skills</li><li>Basic digital literacy, bonus points for previous PV design or PV Electrical experience</li></ul><br><b>Physical Demands</b><br><br><ul><li>Ability to work on rooftops with various angles and surfaces which requires frequent bending, twisting, squatting, climbing, kneeling, crawling, turning, standing, and balance</li><li>Ability to transport materials and equipment to complete assigned job tasks (up to 50 pounds frequently)</li><li>Ability to work and maintain balance on roofs and other areas of height</li><li>Ability to work in confined spaces such as attics, basements, and crawl spaces which requires kneeling and crouching</li><li>Ability to work in outdoor weather conditions including but not limited to: excessive noise, extreme heat, extreme cold, wet environment, and humidity</li><li>Ability to frequently utilize hand functions requiring fine motor skills including but not limited to: fine manipulation, grasping, and pinching</li><li>Ability to work within the safe range of equipment such as ladders, fall protection harnesses and other personal protective equipment</li><li>Ability to hear verbal commands and warnings</li><li>Ability to walk on rafters, roof tiles, and roof shingles without damage</li><li>Ability to work in the sun and possibly low light conditions</li></ul><br><b><b>How you will be Rewarded</b></b><br><br><ul><li>Full benefits package including health, vision, dental insurance, 401K with company match, Employee Stock Purchase Program, paid training, and much more</li><li>The opportunity to invest in yourself and your career through PowerU - Sunrun's 100% tuition reimbursement program with over 150 educational opportunities</li><li>Leadership and financial support in obtaining a Part 107 (drone operation) certification</li><li>Competitive hourly base pay paid biweekly and eligibility for bonus compensation</li><li>Internal advancement opportunities, as earned</li></ul><br><b>Recruiter:</b><br>Reva Tambo (reva.tambo@sunrun.com)<br><br>Please note that the compensation information that follows is a good faith estimate for this position only and is provided pursuant to acts, such as The Equal Pay Transparency Act. It assumes that the successful candidate will be located in markets within the United States that warrant the compensation listed. Candidates in locations outside this local area may have a different  starting salary range for this opportunity which may be higher or lower. Please speak with your recruiter to learn more.<br><br>Starting salary/wage for this opportunity:<br>$24.36 to $32.48<br><br>Sunrun provides a variety of benefits to employees, including health insurance coverage, a wellbeing program, life and disability insurance, a retirement savings plan, paid holidays, and paid time off (PTO). Other rewards may include annual bonus eligibility, based on both company and individual performance, as well as short- and long-term incentives and program-specific awards. Compensation decisions will not be based on a candidate's salary history. <b>Please note: Employee benefits do not apply to our Fusion and Street Sales roles, which are 100% commission-based, (1099-NEC) positions.</b><br><br>This description sets forth the general nature and level of the qualifications and duties required of employees in this job classification, as well as some of the essential functions of this role.  It is not designed to be a comprehensive inventory of all essential duties and qualifications.  If you have a disability or special need that may require reasonable accommodation in order to participate in the hiring process or to perform this role if you are offered employment, please let us know by contacting us at <a href=\"\\&quot;mailto:candidateaccomodations@sunrun.com\\&quot;\" rel=\"noopener noreferrer\">candidateaccomodations@sunrun.com</a>.<br><br>Sunrun is proud to be an equal opportunity employer that does not tolerate discrimination or harassment of any kind. Our commitment to Diversity, Inclusion &amp; Belonging drives our ability to build diverse teams and develop inclusive work environments. At Sunrun, we believe that empowering people and valuing their differences are essential for our mission of connecting people to the cleanest energy on earth. We are committed to equal employment opportunities without consideration of race, color, religion, ethnicity, citizenship, political activity or affiliation, marital status, age, national origin, ancestry, disability, veteran status, sexual orientation, gender identity, gender expression, sex or gender, pregnancy or any other basis protected by law. We also consider qualified applicants with criminal convictions, consistent with applicable federal, state and local law.</p>",
      "name": "Site Survey Technician",
      "type": "external",
      "publication_date": "2025-05-05T21:42:22Z",
      "short_name": "site-survey-technician-ee16ee",
      "model_type": "jobs",
      "id": 18573699,
      "locations": [
        {
          "name": "Paramount, CA"
        }
      ],
      "categories": [
        {
          "name": "Business Operations"
        }
      ],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/sunrun/site-survey-technician-ee16ee"
      },
      "company": {
        "id": 1484,
        "short_name": "sunrun",
        "name": "Sunrun"
      }
    },
    {
      "contents": "<div><p><b><span>Is your current job a nightmare? Make it a dream job at Mattress Firm®!&nbsp;</span></b><span>&nbsp;</span></p></div>\n\n<div><p><i><span>Join Mattress Firm as a </span></i><i><span>Sleep Expert®</span></i><i><span> and have the job of your dreams!&nbsp;</span></i><span>&nbsp;</span></p></div>\n\n<div><p><span><span>Your journey will begin with an extensive, customer-centric retail sales training program that empowers you to create a life-changing in-store experience and help customers build the perfect sleep sanctuary. Helping people sleep well so they live well is at the core of what we do. The right mattress matters, and so does the right career</span><span>.&nbsp;&nbsp;</span><span>&nbsp;</span></span><span>&nbsp;</span></p></div>\n\n<div><p><b><span>Benefits include:</span></b><span>&nbsp;</span></p></div>\n\n<div><p><span><span>Excellent career growth opportunities through on-the-job training and development programs&nbsp;</span></span><span>&nbsp;</span></p></div>\n\n<div><p><span><span>401(k) with employer matching&nbsp;</span></span><span>&nbsp;</span></p></div>\n\n<div><p><span><span>Mental health and life resources&nbsp;</span></span><span>&nbsp;</span></p></div>\n\n<div><p><span><span>Medical, dental, prescription and vision plans&nbsp;</span></span><span>&nbsp;</span></p></div>\n\n<div><p><span><span>Get paid on-</span><span>demand</span><span>&nbsp;&nbsp;</span></span><span>&nbsp;</span></p></div>\n\n<div><p><span><span>Base pay or uncapped commission</span></span><span>&nbsp;</span></p></div>\n\n<div><p><span><span>Employee discounts on </span><span>Mattress Firm</span><span> sleep products and accessories&nbsp;</span></span><span>&nbsp;</span></p></div>\n\n<div><p><span>&nbsp;</span></p></div>\n\n<div><p><b><span>Additional</span><span> </span><span>perks</span><span> may include discounts on the following:</span></b><span>&nbsp;</span></p></div>\n\n<div><p><span><span>Cell phone products and services</span></span><span>&nbsp;</span></p></div>\n\n<div><p><span><span>Tickets to events and attractions</span></span><span>&nbsp;</span></p></div>\n\n<div><p><span><span>Personal travel</span></span><span>&nbsp;</span></p></div>\n\n<div><p><span><span>Electronics and appliance purchases</span></span><span>&nbsp;</span></p></div>\n\n<div><p><span><span>Pet insurance plans</span></span><span>&nbsp;</span></p></div>\n\n<div><p><span><span>Mortgage loan </span><span>rates</span></span><span>&nbsp;</span></p></div>\n\n<div><p><b>Job Details:&nbsp;&nbsp;</b><span>&nbsp;</span></p></div>\n\n<div><div><ul><li><p><span><span>Create an environment where the customer is always at the center by cultivating strong relationships.</span></span><span>&nbsp;</span></p></li></ul></div><div><ul><li><p><span><span>Provide technical and product knowledge information to customers and serve as subject matter expert.&nbsp;</span></span><span>&nbsp;</span></p></li></ul></div><div><ul><li><p><span><span>Drive individual sales performance and KPIs while </span><span>demonstrating</span><span> company values and supporting company initiatives.&nbsp;</span></span><span>&nbsp;</span></p></li></ul></div><div><ul><li><p><span><span>Maintain customer relationships during and after purchase (resolve customer issues, send delivery reminders, etc.).&nbsp;</span></span><span>&nbsp;</span></p></li></ul></div><div><ul><li><p><span><span>Maintain awareness of the competition, </span><span>advertisements</span><span> and services offered by competitors.</span></span><span>&nbsp;</span></p></li></ul></div><div><ul><li><p><span><span>Leverage social media to positively </span><span>impact</span><span> brand awareness and increase sales.&nbsp;</span></span><span>&nbsp;</span></p></li></ul></div><div><p><span><span>&nbsp;</span></span><span>&nbsp;</span></p></div><div><p><b><span>Mattress Firm&nbsp;</span></b><span>&nbsp;</span></p></div><div><p><span><span>We’re</span><span> </span><span>no</span><span> </span><span>ordinary</span><span> mattress company. In just over 30 years, Mattress Firm is America’s most trusted authority on sleep. With more than 2,400 stores nationwide and a team of more than 6,000 Sleep Experts, we have helped millions of people get better sleep. </span><span>That’s</span><span> who we are and what we do—because everyone deserves a great night’s sleep.&nbsp;</span></span><span>&nbsp;</span></p></div><div><p><span><span>&nbsp;</span></span><span>&nbsp;</span></p></div><div><p><span><span>Mattress Firm takes pride in our purpose of helping people sleep well to live well, and we deeply invest in every </span><span>new sales</span><span> associate coming on board to live up to that promise. Our award-winning talent development programs include an education path designed to support all </span><span>new sales</span><span> associates' learning </span><span>proficiency</span><span> </span><span>for</span><span> specialty retail. Not only do we invest in training, but all </span><span>new sales</span><span> associates are eligible for a performance-based bonus after their sixth month of employment.</span></span><span>&nbsp;</span></p></div><div><p><span><span>&nbsp;</span></span><span>&nbsp;</span></p></div><div><p><b><span>DIVERSE CANDIDATES ARE ENCOURAGED TO APPLY&nbsp;</span></b><span>&nbsp;</span></p></div><div><p><span><span>Mattress Firm is an equal employment opportunity employer and is committed to maintaining a non-discriminatory work environment and does not discriminate against any applicant or employee for employment </span><span>on the basis of</span><span> race, color, religion, sex, national origin, age, disability, veteran status, marital status, sexual orientation, gender identity, or any other characteristic protected by applicable law. Mattress Firm is committed to creating a dynamic work environment that values diversity and inclusion, respect and integrity, customer focus, and innovation.</span></span><span>&nbsp;</span></p></div></div>\n\n<p></p>\n\n<p></p>\n\n<p>Pay Range:</p>\n\n<p>50,000 - 70,000<p></p><p></p><p></p><p><span>Now don’t fall asleep out there… the sooner that we receive your application, the closer you are to the career of your dreams!</span></p><p></p><p></p><p><b>DIVERSE CANDIDATES ARE ENCOURAGED TO APPLY</b></p><p></p><p>Mattress Firm is an equal employment opportunity employer and is committed to maintaining a non-discriminatory work environment, and does not discriminate against any applicant or employee for employment on the basis of race, color, religion, sex, national origin, age, disability, veteran status, marital status, sexual orientation, gender identity, or any other characteristic protected by applicable law. Mattress Firm is committed to creating a dynamic work environment that values diversity and inclusion, respect and integrity, customer focus, and innovation.</p></p>",
      "name": "Sleep Expert - Sales",
      "type": "external",
      "publication_date": "2025-07-13T09:58:39Z",
      "short_name": "sleep-expert-sales-4e1624",
      "model_type": "jobs",
      "id": 19205599,
      "locations": [
        {
          "name": "Richmond, VA"
        }
      ],
      "categories": [
        {
          "name": "Human Resources and Recruitment"
        }
      ],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/mattressfirm/sleep-expert-sales-4e1624"
      },
      "company": {
        "id": 15000576,
        "short_name": "mattressfirm",
        "name": "Mattress Firm"
      }
    },
    {
      "contents": "<p><span><p>Lincoln Electric is the world leader in the engineering, design, and manufacturing of advanced arc welding solutions, automated joining, assembly and cutting systems, plasma and oxy-fuel cutting equipment, and has a leading global position in brazing and soldering alloys. Lincoln is recognized as the Welding Expert™ for its leading materials science, software development, automation engineering, and application expertise, which advance customers' fabrication capabilities to help them build a better world. Headquartered in Cleveland, Ohio, Lincoln Electric is a $4.2B publicly traded company (NASDAQ:LECO) with over 12,000 employees around the world, with operations in 71 manufacturing and automation system integration locations across 21 countries and maintains a worldwide network of distributors and sales offices serving customers in over 160 countries.</p></p>\n<p>&nbsp;</p>\n\n<p>Location: <b>Euclid - 22801</b>&nbsp;<br>\nEmployment Status: <b>Salary Full-Time</b>&nbsp;<br>\nFunction: <b>Engineering</b>&nbsp;<br>\nReq ID:&nbsp;<b>26401</b>&nbsp;</p>\n\n<p>&nbsp;</p>\n\n<p>​</p>\n\n<p>​</p>\n\n<div>\n<div>\n<div>\n<h2>Summary</h2>\n</div>\n<div>\n<p>&nbsp;</p>\n\n<p><span>Lincoln electric has an outstanding opportunity for a Control Systems Engineer at our Cleveland, Ohio headquarters. The Control Systems Engineer is a key member of the Plant Engineering team that implements&nbsp;projects and provides support for the Consumable division of the Cleveland Operations. Control System Engineers are responsible for the physical machine hardware used in manufacturing, the networks that connect them, and the software controlling them.</span></p>\n\n<p>&nbsp;</p>\n\n<p><span>In addition to competitive pay, Lincoln Electric offers a lucrative profit-sharing plan, student loan repayment program PLUS tuition reimbursement, medical/dental/vision, 401(k) with company match, paid time off and many more outstanding benefits!&nbsp;</span></p>\n\n<p>&nbsp;</p>\n\n<p><span><b>What You Will Do&nbsp;</b></span><br>\n&nbsp;</p>\n\n<ul>\n    <li><span>Responsible for the control systems including hardware design, software design, design documentation,&nbsp;networking, and data acquisition.</span></li>\n    <li><span>Work closely with the Plant Engineering, MES, IT, Maintenance, and Production teams to support production and facility projects that involve networking, PLCs, HMIs, and associated software.</span></li>\n    <li><span>Collaborate with multiple Operations teams to meet current and future continuous improvement project goals.</span></li>\n    <li><span>Estimates time and cost for new projects.</span></li>\n    <li><span>Reviews capital equipment proposals and quotations to ensure equipment meets company specifications for control systems.</span></li>\n    <li><span>Provides on-site assistance troubleshooting and remediating hardware, software, and network issues with Plant Engineering, Maintenance, and IT team members.</span></li>\n    <li><span>Reduce downtime on production equipment due to issues with the control system.</span></li>\n    <li><span>Support network backup and device patching management process.</span></li>\n    <li><span>Assist in management and inventory of control system assets including software, servers, devices, and workstations.</span></li>\n    <li><span>Improve system and maintenance performance based on availability and reliability.</span></li>\n    <li><span>Review security vulnerabilities and request appropriate remediation form respective teams.</span></li>\n    <li><span>Compiling data from connected devices and making it available to the users throughout the organization.</span></li>\n    <li><span>Develops and applies standards for control systems hardware and software.</span></li>\n    <li><span>Solves complex problems; takes a new perspective on existing solutions.</span></li>\n    <li><span>Works independently; receives minimal guidance.</span></li>\n    <li><span>May lead projects or project steps within a broader project or have accountability for ongoing activities or objectives.</span></li>\n    <li><span>Acts as a resource for colleagues with less experience.</span></li>\n    <li><span>Assumes additional responsibilities as assigned to support Lincoln Electric Company’s 2025 Higher Standard&nbsp;Strategy</span></li>\n</ul>\n</div>\n</div>\n<div>\n<div>\n<h2>Education &amp; Experience Requirements</h2>\n</div>\n<div>\n<p>&nbsp;</p>\n\n<ul>\n    <li><span>Minimum of a Bachelor's degree in Electrical Engineering.</span></li>\n    <li><span>Minimum of 5 years professional experience.</span></li>\n    <li><span>Experience with automation hardware and software platforms, including PLC and HMI.</span></li>\n    <li><span>Experience with AutoCAD.</span></li>\n    <li><span>Knowledge of NEC, NFPA, 70E, NFPA 79, and other technical codes.</span></li>\n    <li><span>Ability to support and troubleshoot industrial equipment.</span></li>\n    <li><span>Critical thinking with exceptional problem-solving skills.</span></li>\n    <li><span>Ability to handle a variety of assignment and changing priorities.</span></li>\n    <li><span>Work effectively with employees on all levels of the organization.</span></li>\n    <li><span>Provide excellent written and oral communications.</span></li>\n</ul>\n</div>\n</div>\n</div>\n\n<p>&nbsp;</p>\n\n<p><b>Lincoln Electric is an Equal Opportunity Employer.</b> We are committed to promoting equal employment opportunity for applicants, without regard to their race, color, national origin, religion, sex (including pregnancy, childbirth, or related medical conditions, including, but not limited to, lactation), sexual orientation, gender identity, age, veteran status, disability, genetic information, and any other category protected by federal, state, or local law.</p>\n\n<pre><code>            &lt;/span&gt;\n</code></pre>",
      "name": "Control Systems Engineer",
      "type": "external",
      "publication_date": "2025-07-13T10:06:14Z",
      "short_name": "control-systems-engineer-37c850",
      "model_type": "jobs",
      "id": 19243963,
      "locations": [
        {
          "name": "Kent, OH"
        }
      ],
      "categories": [
        {
          "name": "Science and Engineering"
        }
      ],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/lincolnelectric/control-systems-engineer-37c850"
      },
      "company": {
        "id": 15000795,
        "short_name": "lincolnelectric",
        "name": "Lincoln Electric"
      }
    },
    {
      "contents": "<p><b><strong>About the Team</strong></b><br><br>DoorDash is building the world's most reliable on-demand logistics engine. Behind the scenes, our Machine Learning Platform (MLP) powers critical real-time decision-making for millions of orders each day, supporting business-critical use cases like Ads, Groceries, Logistics, Fraud, and Search.<br><br>We're looking for a Staff Software Engineer to lead our ML Serving initiatives-enabling seamless, high-performance, and highly scalable model inference at DoorDash. You will guide a small, talented team in developing and operating a next-generation ML serving platform that handles millions of QPS across a global marketplace.<br><br><b><strong>About the Role</strong></b><br><br>As the technical lead for ML Serving Platform, you will have a direct impact on DoorDash's most mission-critical services, ensuring our models deliver real-time predictions reliably and at scale. You will partner closely with ML Engineers, and Infrastructure teams to design and operate the serving stack-everything from containerized model deployments to advanced feature lookups and GPU-based serving.<br><br>You will drive the roadmap, architecture, and best practices for a platform that must remain highly available, isolated across workloads, and cost-efficient-all while enabling rapid experimentation and iteration for model owners.<br><br>This is a hybrid opportunity in San Francisco, Sunnyvale, Seattle, or New York.<br><br><b><strong>You're excited about this opportunity because you will...</strong></b><br><br><ul><li><strong>Lead the Vision &amp; Architecture</strong> - Set the technical direction for an extremely high-QPS (multi-million QPS) serving platform, enabling rapid and reliable deployment of ML models across a variety of use cases.</li><li><strong>Build for Scale &amp; Reliability</strong> - Own and evolve our model serving stack to ensure zero-downtime, 24/7 operations. You'll tackle unique scaling challenges around throughput, isolation, and latency.</li><li><strong>Enable Self-Serve Model Deployments</strong> - Develop abstractions, ensuring that ML Engineers can seamlessly bring their own models (BYOM), and custom GPU-accelerated workloads online.</li><li><strong>Improve Developer Velocity</strong> - Drive innovations that reduce time-to-production. Standardize workflows for deploying, validating, and monitoring ML services with strong observability and debugging capabilities.</li><li><strong>Collaborate Across the Company</strong> - Work closely with teams in Ads, Fraud, Logistics, Groceries, and more to tailor the serving platform for their specific needs while maintaining a core set of robust, reusable components.</li><li><strong>Mentor &amp; Lead</strong> - Guide a small but growing team of senior engineers. Champion best practices, set coding standards, conduct design reviews, and help shape DoorDash's ML culture.</li></ul><br><b><strong>We're excited about you because...</strong></b><br><br><ul><li>8+ years of industry experience in software engineering, with at least 1 year of technical lead experience.</li><li>Deep expertise in building large-scale, distributed systems-you're comfortable architecting services that handle millions of requests per second with single-digit millisecond latencies.</li><li>Strong knowledge of CS fundamentals and experience with programming languages like Python, golang, Kotlin, C++, or Java.</li><li>Experience with production ML systems-you've built or operated high-QPS inference services, real-time feature stores, or large-scale data pipelines.</li><li>Passion for reliability &amp; performance-you've developed strategies for zero-downtime deployments, high availability, and low-latency serving, and you understand cost vs. performance trade-offs.</li><li>Track record of technical leadership-you excel at collaboration, driving projects end-to-end, and mentoring other engineers in best practices.</li></ul><br><strong>Nice To Haves</strong><br><br><ul><li>GPU experience for ML serving and real-time inference.</li><li>Familiarity with deep learning frameworks (PyTorch, TensorFlow) and large language models (LLMs) such as GPT or BERT.</li><li>Experience with microservices and container orchestration (Kubernetes, EKS).</li><li>Cloud computing experience (AWS, GCP, etc.), including cost attribution and optimization.</li><li>Background in model lifecycle management (MLflow, ML Orchestration systems, or metadata tracking).</li></ul><br>Notice to Applicants for Jobs Located in NYC or Remote Jobs Associated With Office in NYC Only<br><br>We use Covey as part of our hiring and/or promotional process for jobs in NYC and certain features may qualify it as an AEDT in NYC. As part of the hiring and/or promotion process, we provide Covey with job requirements and candidate submitted applications. We began using Covey Scout for Inbound from August 21, 2023, through December 21, 2023, and resumed using Covey Scout for Inbound again on June 29, 2024.<br><br>The Covey tool has been reviewed by an independent auditor. Results of the audit may be viewed here: Covey<br><br><strong>Compensation<br></strong><br><br>The successful candidate's starting pay will fall within the pay range listed below and is determined based on job-related factors including, but not limited to, skills, experience, qualifications, work location, and market conditions.  Base salary is localized according to an employee's work location. Ranges are market-dependent and may be modified in the future.<br><br>In addition to base salary, the compensation for this role includes opportunities for equity grants. Talk to your recruiter for more information.<br><br>DoorDash cares about you and your overall well-being. That's why we offer a comprehensive benefits package to all regular employees, which includes a 401(k) plan with employer matching, 16 weeks of paid parental leave, wellness benefits, commuter benefits match, paid time off and paid sick leave in compliance with applicable laws (e.g. Colorado Healthy Families and Workplaces Act). DoorDash also offers medical, dental, and vision benefits, 11 paid holidays, disability and basic life insurance, family-forming assistance, and a mental health program, among others.<br><br>To learn more about our benefits, visit our careers page here.<br><br>See below for paid time off details:<br><br><ul><li><strong>For salaried roles:</strong> flexible paid time off/vacation, plus 80 hours of paid sick time per year.</li><li><strong>For hourly roles:</strong> vacation accrued at about 1 hour for every 25.97 hours worked (e.g. about 6.7 hours/month if working 40 hours/week; about 3.4 hours/month if working 20 hours/week), and paid sick time accrued at 1 hour for every 30 hours worked (e.g. about 5.8 hours/month if working 40 hours/week; about 2.9 hours/month if working 20 hours/week).</li></ul><br><strong>The national base pay ranges for this position within the United States, including Illinois and Colorado.</strong><br><br>I4<br><br>$130,600-$192,000 USD<br><br>I5<br><br>$159,800-$235,000 USD<br><br>I6<br><br>$193,800-$285,000 USD<br><br><b><strong>About DoorDash</strong></b><br><br>At DoorDash, our mission to empower local economies shapes how our team members move quickly, learn, and reiterate in order to make impactful decisions that display empathy for our range of users-from Dashers to merchant partners to consumers. We are a technology and logistics company that started with door-to-door delivery, and we are looking for team members who can help us go from a company that is known for delivering food to a company that people turn to for any and all goods. <br><br>DoorDash is growing rapidly and changing constantly, which gives our team members the opportunity to share their unique perspectives, solve new challenges, and own their careers. We're committed to supporting employees' happiness, healthiness, and overall well-being by providing comprehensive benefits and perks including premium healthcare, wellness expense reimbursement, paid parental leave and more.<br><br><b><strong>Our Commitment to Diversity and Inclusion</strong></b><br><br>We're committed to growing and empowering a more inclusive community within our company, industry, and cities. That's why we hire and cultivate diverse teams of people from all backgrounds, experiences, and perspectives. We believe that true innovation happens when everyone has room at the table and the tools, resources, and opportunity to excel.<br><br>Statement of Non-Discrimination: In keeping with our beliefs and goals, no employee or applicant will face discrimination or harassment based on: race, color, ancestry, national origin, religion, age, gender, marital/domestic partner status, sexual orientation, gender identity or expression, disability status, or veteran status. Above and beyond discrimination and harassment based on \"protected categories,\" we also strive to prevent other subtler forms of inappropriate behavior (i.e., stereotyping) from ever gaining a foothold in our office. Whether blatant or hidden, barriers to success have no place at DoorDash. We value a diverse workforce - people who identify as women, non-binary or gender non-conforming, LGBTQIA+, American Indian or Native Alaskan, Black or African American, Hispanic or Latinx, Native Hawaiian or Other Pacific Islander, differently-abled, caretakers and parents, and veterans are strongly encouraged to apply. Thank you to the Level Playing Field Institute for this statement of non-discrimination.<br><br>Pursuant to the San Francisco Fair Chance Ordinance, Los Angeles Fair Chance Initiative for Hiring Ordinance, and any other state or local hiring regulations, we will consider for employment any qualified applicant, including those with arrest and conviction records, in a manner consistent with the applicable regulation.<br><br>If you need any accommodations, please inform your recruiting contact upon initial connection.</p>",
      "name": "Staff Software Engineer, ML Serving Platform",
      "type": "external",
      "publication_date": "2025-05-31T12:08:08Z",
      "short_name": "staff-software-engineer-ml-serving-platform",
      "model_type": "jobs",
      "id": 18262862,
      "locations": [
        {
          "name": "New York, NY"
        },
        {
          "name": "San Francisco, CA"
        },
        {
          "name": "Seattle, WA"
        },
        {
          "name": "Sunnyvale, CA"
        }
      ],
      "categories": [
        {
          "name": "Data and Analytics"
        }
      ],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/doordash/staff-software-engineer-ml-serving-platform"
      },
      "company": {
        "id": 15000097,
        "short_name": "doordash",
        "name": "DoorDash"
      }
    },
    {
      "contents": "<p><strong>Family Counseling Associates of Massachusetts, part of the Optum family of businesses is seeking a Licensed Clinical Therapist - LICSW, LMHC or LMFT to join our team in Beverly, MA. Optum is a clinician-led care organization that is changing the way clinicians work and live.</strong></p>\n\n<p><br><strong>As a member of the Optum Behavioral Care Team, you’ll be an integral part of our vision to make healthcare better for everyone.</strong></p>\n\n<p><br>Explore opportunities at Optum Behavioral Care. We’re revolutionizing behavioral health care delivery for individuals, clinicians and the entire health care system. Together, we are bringing high-end medical service, compassionate care and industry leading solutions to our most vulnerable patient populations. Our holistic approach addresses the physical, mental and social needs of our patients wherever they may be - helping patients access and navigate care anytime and anywhere. We’re connecting care to create a seamless health journey for patients across care settings. Join our team, it’s your chance to improve the lives of millions while <strong>Caring. Connecting. Growing together. </strong></p>\n\n<p><br>As a Licensed Clinical Therapist / Independent Licensed Therapist, you will treat a wide variety of mental health conditions that reflect the needs of our diverse patient population. You will provide patients with behavioral and mental health treatments through individual and family therapy as needed</p>\n\n<p><br><strong>Primary Responsibilities:</strong></p>\n\n<ul>\n<li>Form excellent provider-patient alliances and coordinate care with external providers</li>\n<li>Conduct outpatient psychiatric evaluations and provide ongoing medication management</li>\n<li>Participate in enriching the training experience of our graduate students</li>\n<li>Screen and assess patients for common mental health and substance abuse disorders</li>\n<li>Provide treatment for a variety of mental health conditions using treatment approaches including cognitive behavioral therapy, dialectical behavioral therapy, and other evidence-based methods</li>\n<li>Systematically track treatment response and monitor patients for changes in clinical symptoms and treatment side effects or complications</li>\n<li>Opportunities to represent the practice in community presentations and lectures</li>\n<li>Maintain accurate and up-to-date electronic medical records (Athena) and clinical documentation, ensuring compliance with all regulatory requirements</li>\n</ul>\n\n<p><br>You’ll be rewarded and recognized for your performance in an environment that will challenge you and give you clear direction on what it takes to succeed in your role as well as provide development for other roles you may be interested in.</p>\n\n<p><strong>Required Qualifications:</strong></p>\n\n<ul>\n<li>Master’s degree in psychology, social work, or a related counseling field</li>\n<li>Clear, active and unrestricted license (LICSW, LMFT, LMHC, or LPC) in the state of practice</li>\n</ul>\n\n<p><br><strong>Preferred Qualifications:</strong></p>\n\n<ul>\n<li>2+ years professional social work / clinical experience post Master's degree<b></b></li>\n<li>Experience providing direct psychotherapy services to individuals and families<b></b></li>\n<li>Experience working with computers for professional communication and medical documentation - Excel, Outlook, Athena RMS (or other EHRs)</li>\n<li>Proven ability to work both independently and collaboratively with equal effectiveness</li>\n</ul>\n\n<p><br><em>OptumCare is an Equal Employment Opportunity employer under applicable law and qualified applicants will receive consideration for employment without regard to race, national origin, religion, age, color, sex, sexual orientation, gender identity, disability, or protected veteran status, or any other characteristic protected by local, state, or federal laws, rules, or regulations.   </em></p>\n\n<p><br><em>OptumCare is a drug-free workplace. Candidates are required to pass a drug test before beginning employment. </em></p>",
      "name": "Hybrid Licensed Clinical Therapist",
      "type": "external",
      "publication_date": "2025-07-13T21:55:51Z",
      "short_name": "hybrid-licensed-clinical-therapist-30f0c7",
      "model_type": "jobs",
      "id": 19453399,
      "locations": [
        {
          "name": "Andover, MA"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/optum/hybrid-licensed-clinical-therapist-30f0c7"
      },
      "company": {
        "id": 15000934,
        "short_name": "optum",
        "name": "Optum"
      }
    },
    {
      "contents": "<p><b>Job Description:</b><br><br>At Bank of America, we are guided by a common purpose to help make financial lives better through the power of every connection. Responsible Growth is how we run our company and how we deliver for our clients, teammates, communities and shareholders every day.<br> <br>One of the keys to driving Responsible Growth is being a great place to work for our teammates around the world. We're devoted to being a diverse and inclusive workplace for everyone. We hire individuals with a broad range of backgrounds and experiences and invest heavily in our teammates and their families by offering competitive benefits to support their physical, emotional, and financial well-being.<br> <br>Bank of America believes both in the importance of working together and offering flexibility to our employees. We use a multi-faceted approach for flexibility, depending on the various roles in our organization.<br> <br>Working at Bank of America will give you a great career with opportunities to learn, grow and make an impact, along with the power to make a difference. Join us!<br><br><b><strong>This position is open for the entire market and the specific Financial Center location will be based on business needs.  If you are offered a position, you will train at one financial center, and then potentially move to another location that is within a reasonable commuting distance of your home to the extent permitted by applicable law.</strong></b><br><br>Job Description:<br>This job is responsible for engaging clients in the lobby to educate and assist with conducting transactions through self-service resources, such as mobile banking, online banking, or ATM. Key responsibilities include accurately and efficiently processing cash transactions for clients as needed. Job expectations include having deep conversations with clients to gain in-depth knowledge of the financial and life priorities and connecting clients to solutions that meet the financial goals.<br><br>Responsibilities:<br>•  Executes the bank's risk culture and strives for operational excellence<br>•  Builds relationships with clients to meet financial needs<br>•  Follows established processes and guidelines in daily activities to do what is right for clients and the bank, adhering to all applicable laws and regulations<br>•  Grows business knowledge and network by partnering with experts in small business, lending, and investments<br>•  Manages financial center traffic, appointments, and outbound calls effectively<br>•  Drives the client experience<br>•  Manages cash responsibilities<br><br>Required Qualifications:<br>•  Is an enthusiastic, highly motivated self-starter with a strong work ethic and intense focus on results, acting in the best interest of the client.<br>•  Collaborates effectively to get things done, building and nurturing strong relationships.<br>•  Displays passion, commitment and drive to deliver an experience that improves our clients' financial lives.<br>•  Is confident in identifying solutions for new and existing clients based on their needs.<br>•  Communicates effectively and confidently, and is comfortable engaging all clients.<br>•  Has the ability to learn and adapt to new information and technology platforms.<br>•  Is confident in educating clients on how to conduct simple banking transactions through self-service technologies (for example, ATM, online banking, mobile banking).<br>•  Applies strong critical thinking and problem-solving skills to meet clients' needs.<br>•  Will follow established processes and guidelines in daily activities to do what is right for clients and the bank, adhering to all applicable laws and regulations.<br>•  Efficiently manages time and capacity.<br>•  Focuses on results, while acting in the best interest of the client.<br>•  Can be flexible to work weekends and/or extended hours as needed.<br><br>Desired Qualifications:<br>•  Experience in financial services and knowledge of financial services industry, products and solutions.<br>•  One year of demonstrated successful sales experience in a salary plus incentive environment with individual sales goals.<br>•  Six months of cash handling experience.<br>•  Bachelor's Degree or business-relevant Associate's Degree such as business management, business administration or finance<br><br>Skills:<br>•  Adaptability<br>•  Business Acumen<br>•  Customer and Client Focus<br>•  Oral Communications<br>•  Problem Solving<br>•  Account Management<br>•  Client Experience Branding<br>•  Client Management<br>•  Client Solutions Advisory<br>•  Relationship Building<br>•  Business Development<br>•  Pipeline Management<br>•  Prospecting<br>•  Referral Identification<br>•  Referral Management<br><br>Minimum Education Requirement:<br>•  High School Diploma / GED / Secondary School or equivalent<br><br>The following laws or regulations restrict or prohibit the hiring of individuals with certain specified criminal history for the position: FDIC; Loan Originators<br><br><b>Shift:</b><br>1st shift (United States of America)<br><br><b>Hours Per Week: </b><br>40<br><br><b>Pay Transparency details</b><br><br>US - CA - Salinas - 405 Main St - SALINAS MAIN OFFICE (CA2110)<br><br>Pay and benefits information<br><br>Pay range<br><br>$24.00 - $26.27 hourly pay, offers to be determined based on experience, education and skill set.<br><br>Predictable pay<br><br>This role is compensated with a base salary and is not incentive eligible.<br><br>Benefits<br><br>This role is currently benefits eligible. We provide industry-leading benefits, access to paid time off, resources and support to our employees so they can make a genuine impact and contribute to the sustainable growth of our business and the communities we serve.</p>",
      "name": "Relationship Banker - bilingual Spanish required",
      "type": "external",
      "publication_date": "2025-06-21T23:57:31Z",
      "short_name": "relationship-banker-bilingual-spanish-required-504e1c",
      "model_type": "jobs",
      "id": 19340837,
      "locations": [
        {
          "name": "Salinas, CA"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/bankofamerica/relationship-banker-bilingual-spanish-required-504e1c"
      },
      "company": {
        "id": 12145,
        "short_name": "bankofamerica",
        "name": "Bank of America"
      }
    },
    {
      "contents": "<p>With a culture of recognition and reputation for excellence, ELS is the ideal organization in which to develop a long and successful career!<br><br>ELS is hiring for the position of Property Manager in Ocean View, New Jersey.<br><br><b>Property Manager</b><br><br><b>What you'll do:</b><br><br>The PropertyManager provides exceptional customer service to attract and serve our guests and ensure that we meet our financial goals.<br><br><b>Your job will include:</b><br><br><ul><li>Provide exceptional customer service to residents and guests to ensure an excellent experience.</li><li>Manage the resources and assets of the property, including buildings and amenities.</li><li>Conduct marketing activities to attract new customers.</li><li>Hire and manage resort employees.</li><li>Prepare, manage and analyze the operational budget of the resort.</li><li>Maximize the profitability of the property.</li><li>Maintain the resort and ensure that it's clean and attractive.</li><li>Partner with the marketing team to attract new guests.</li><li>Analyze, prepare and manage the operational budget of the resort to improve its profitability.</li></ul><br><b>Your skills and experience include:</b><br><br><ul><li>Bachelor's degree, or a combination of education and equivalent experience.</li><li>5+ years of property management experience, preferably in an RV or manufacturing home community setting.</li><li>Strong operations skills and a thorough understanding of the complexities of this position.</li><li>At least one year of experience in customer service and exceptional customer service skills.</li><li>Excellent skills in Microsoft Office and other web-based applications.</li><li>Valid driver's license, good driving record and current auto insurance.</li><li>Experience in sales and/or marketing preferred.</li></ul><br>In return for your excellent skills and abilities, we offer a comprehensive benefits package including: medical, dental, and vision plans, a generous 401(k) employer match, and paid vacations, holidays, and sick time.<br><br>We invite you to visit our web site at <a href=\"\\&quot;http://www.equitylifestyleproperties.com/\\&quot;\" rel=\"noopener noreferrer\">www.equitylifestyleproperties.com</a> for additional information regarding our exceptional resort communities.<br><br>As an Equal Opportunity Employer, we welcome and thank all applicants.<br><br><b>Estimated compensation for this position in the states of CA, CO, IL, MD, MN, NY, and WA is:</b><br><br>Annual Salary: $78,000.00 - $84,000.00<br><br>The salary listed is an estimate and not guaranteed. A salary offer will vary based on applicant's education, experience, skills, abilities, geographic location, internal equity and alignment with market data. In addition to the base pay and our benefits, some positions are eligible for bonuses, sales commissions, or incentive pay.</p>",
      "name": "Property Manager",
      "type": "external",
      "publication_date": "2025-06-03T11:34:38Z",
      "short_name": "property-manager-c0a5b3",
      "model_type": "jobs",
      "id": 19153449,
      "locations": [
        {
          "name": "Ocean View, NJ"
        }
      ],
      "categories": [
        {
          "name": "Real Estate"
        }
      ],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/equitylifestyleproperties/property-manager-c0a5b3"
      },
      "company": {
        "id": 11723,
        "short_name": "equitylifestyleproperties",
        "name": "Equity Lifestyle Properties"
      }
    },
    {
      "contents": "<div><p><b>Senior Campaign Manager</b></p><p><b>Corporate Headquarters</b></p><p><b>12575 Uline Drive, Pleasant Prairie, WI 53158</b></p><p></p><p>Make your mark on digital marketing strategy with a growing North American company - at Uline! As a Senior Campaign Manager, you'll drive paid search strategies for Uline.com, optimizing campaigns and fueling traffic to one of North America's largest eCommerce sites.</p><p></p><p><b>We're growing - and hiring multiple candidates for this role!</b></p><p></p><p><b>Careers Packed with Potential. </b>Backed by 45+ years of success, Uline offers opportunities to grow your career with stability you can count on.</p><p></p><p><b>Position Responsibilities</b></p></div>\n\n<div><div><div><div><div><div><div><div><div><div><div><div><div><div><div><div><div><ul><li><p>Manage text and shopping ad campaigns across multiple product lines and / or business areas.</p></li><li><p>Analyze campaign performance and interpret results to make performance improvement recommendations.</p></li><li><p>Guide, coach and develop a team of Campaign Managers.</p></li><li><p>Maintain in depth understanding of available tactics within ad programs on Google and Microsoft.</p></li></ul><p></p><p><b>Minimum Requirements</b></p><ul><li><p>Bachelor’s degree in marketing, advertising or a related field. Master's degree <b>preferred.</b></p></li><li><p>3+ years of digital marketing experience directly managing paid search programs.</p></li><li><p>Proficient in Microsoft Office, Google AdWords, Bing Ads and Google Analytics.</p></li><li><p>Excellent communication and presentation skills.</p></li><li><p>Adaptable with strong accuracy and attention to detail.</p></li></ul><p></p><p><b>Benefits</b></p><ul><li><p>Complete health insurance coverage and 401(k) with 6% employer match that <u>starts day one</u>!</p></li><li><p>Multiple bonus programs.</p></li><li><p>Paid holidays and generous paid time off.</p></li><li><p>Tuition Assistance Program that covers professional continuing education.</p></li></ul><p></p><p><b>Employee Perks</b></p><ul><li><p>On-site café and first-class fitness center with complimentary personal trainers.</p></li><li><p>Over four miles of beautifully maintained walking trails.</p></li></ul><p></p><div><p><b>About Uline</b></p><p></p><p>Uline, a family-owned company, is North America’s leading distributor of shipping, industrial, and packaging materials with over 9,000 employees across 14 locations.</p><p></p><p>Uline is a&nbsp;<u>drug-free workplace</u>. All positions are on-site.</p><p></p><p>EEO/AA&nbsp;Employer/Vet/Disabled</p><p></p><p>#LI-JD1</p><p>#CORP</p><p>(#IN-PPCIR)</p></div></div></div></div></div></div></div></div></div></div></div></div></div></div></div></div></div></div>",
      "name": "Senior Campaign Manager",
      "type": "external",
      "publication_date": "2025-07-12T15:46:51Z",
      "short_name": "senior-campaign-manager-3bccd7",
      "model_type": "jobs",
      "id": 19436453,
      "locations": [
        {
          "name": "Rolling Meadows, IL"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/ulineinc/senior-campaign-manager-3bccd7"
      },
      "company": {
        "id": 15000556,
        "short_name": "ulineinc",
        "name": "Uline, Inc."
      }
    },
    {
      "contents": "<p>Overview: <p>SimVentions, consistently voted one Virginia's Best Places to Work, is looking for an experienced cybersecurity professional to join our team! As a Cybersecurity Engineer III, you will play a key role in advancing cybersecurity operations by performing in-depth system hardening, vulnerability assessment, and security compliance activities in accordance with DoD requirements. The ideal candidate will have a solid foundation in cybersecurity practices and proven experience supporting both Linux and Windows environments across DoD networks. You will work collaboratively with Blue Team, Red Team, and other Cybersecurity professionals on overall cyber readiness defense and system accreditation efforts.&nbsp;</p><p>&nbsp;</p><p><strong> Position is contingent upon award of contract, anticipated in December of 2025. </strong></p> Clearance: <p>An ACTIVE Secret clearance (IT Level II Tier 5 / Special-Sensitive Position) is required for this position. Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information. US Citizenship is required to obtain a clearance.</p> Requirements: <ul><li>In-depth understanding of computer security, military system specifications, and DoD cybersecurity policies</li><li>Strong ability to communicate clearly and succinctly in written and oral presentations</li><li>Must possess one of the following DoD 8570.01-M IAT Level III baseline certifications:<ul><li>CASP+ CE</li><li>CCNP Security</li><li>CISA</li><li>CISSP (Associate)</li><li>CISSP</li><li>GCED</li><li>GCIH</li><li>CCSP</li></ul></li></ul> Responsibilities: <ul><li>Develop Assessment and Authorization (A&amp;A) packages for various systems</li><li>Develop and maintain security documentation such as:</li><ul><li>Authorization Boundary Diagram</li><li>System Hardware/Software/Information Flow</li><li>System Security Plan</li><li>Privacy Impact Assessment</li><li>e-Authentication</li><li>Implementation Plan</li><li>System Level Continuous Monitoring Plan</li><li>Ports, Protocols and Services Registration</li><li>Plan of Action and Milestones (POA&amp;M)</li></ul><li>Conduct annual FISMA assessments</li><li>Perform Continuous Monitoring of Authorized Systems</li><li>Generate and update test plans; conduct testing of the system components using the Assured Compliance Assessment Solution (ACAS) tool, implement Security Technical Implementation Guides (STIG), and conduct Information Assurance Vulnerability Management (IAVM) reviews</li><li>Perform automated ACAS scanning, STIG, SCAP checks (Evaluate STIG, Tenable Nessus, etc.) on various standalone and networked systems</li><li>Analyze cybersecurity test scan results and develop/assist with documenting open findings in the Plan of Action and Milestones (POA&amp;M)</li><li>Analyze DISA Security Technical Implementation Guide test results and develop/assist with documenting open findings in the Plan of Action and Milestones</li></ul> Preferred Skills and Experience: <p>A combined total of ten (10) years of full-time professional experience in all of the following functional areas:</p><ul><li>Computer security, military system specifications, and DoD cybersecurity policies</li><li>National Cyber Range Complex (NCRC) Total Ship Computing Environment (TSCE) Program requirements and mission, ship install requirements, and protocols (preferred)</li><li>Risk Management Framework (RMF), and the implementation of Cybersecurity and IA boundary defense techniques and various IA-enabled appliances. Examples of these appliances and applications are Firewalls, Intrusion Detection System (IDS), Intrusion Prevention System (IPS), Switch/Routers, Cross Domain Solutions (CDS), EMASS and, Endpoint Security Solution (ESS)</li><li>Performing STIG implementation</li><li>Performing vulnerability assessments with the ACAS tool</li><li>Remediating vulnerability findings to include implementing vendor patches on both Linux and Windows Operating systems</li></ul> Education: Bachelor of Science in Information Systems, Bachelor of Science in Information Technology, Bachelor of Science in Computer Science, Bachelor of Science in Computer Engineering Compensation: <p><span><span>Compensation at SimVentions is determined by a number of factors, including, but not limited to, the candidate’s experience, education, training, security clearance, work location, skills, knowledge, and competencies, as well as alignment with our corporate compensation plan and contract specific requirements.</span></span></p><p>&nbsp;</p><p><span>The projected annual compensation range for this position is $90,000 - $160,000 (USD). This estimate reflects the standard salary range for this position and is just one component of the total compensation package that SimVentions offers.&nbsp;</span></p> Benefits: <p>At SimVentions, we’re committed to supporting the total well-being of our employees and their families. Our benefit offerings include comprehensive health and welfare plans to serve a variety of needs.&nbsp;</p><p><br>We offer:</p><p>&nbsp;</p><ul><li>Medical, dental, vision, and prescription drug coverage</li><li>Employee Stock Ownership Plan (ESOP)</li><li>Competitive 401(k) programs</li><li>Retirement and Financial Counselors</li><li>Health Savings and Health Reimbursement Accounts</li><li>Flexible Spending Accounts</li><li>Life insurance, short- &amp; long-term disability</li><li>Continuing Education Assistance</li><li>Paid Time Off, Paid Holidays, Paid Leave (e.g., Maternity, Paternity, Jury Duty, Bereavement, Military)</li><li>Third Party Employee Assistance Program that offers emotional and lifestyle well-being services, to include free counseling</li><li>Supplemental Benefit Program&nbsp;</li></ul> Why Work for SimVentions?: <p>SimVentions is about more than just being a place to work with other growth-orientated technically exceptional experts. It’s also a fun place to work. Our family-friendly atmosphere encourages our employee-owners to imagine, create, explore, discover, and do great things together.</p><p>&nbsp;</p><p><strong>Support Our Warfighters</strong></p><p>&nbsp;</p><p>SimVentions is a proud supporter of the U.S. military, and we take pride in our ability to provide relevant, game-changing solutions to our armed men and women around the world.</p><p>&nbsp;</p><p><strong>Drive Customer Success</strong></p><p>&nbsp;</p><p>We deliver innovative products and solutions that go beyond the expected. This means you can expect to work with a team that will allow you to grow, have a voice, and make an impact.<br><br><strong>Get Involved in Giving Back</strong></p><p>&nbsp;</p><p>We believe a well-rounded company starts with well-rounded employees, which is why we offer diverse service opportunities for our team throughout the year.</p><p>&nbsp;</p><p><strong>Build Innovative Technology</strong></p><p>&nbsp;</p><p>SimVentions takes pride in its innovative and cutting-edge technology, so you can be sure that whatever project you work on, you will be having a direct impact on our customer’s success.</p><p>&nbsp;</p><p><strong>Work with Brilliant People</strong></p><p>&nbsp;</p><p>We don’t just hire the smartest people; we seek experienced, creative individuals who are passionate about their work and thrive in our unique culture.</p><p>&nbsp;</p><p><strong>Create Meaningful Solutions</strong></p><p>&nbsp;</p><p>We are trusted partners with our customers and are provided challenging and meaningful requirements to help them solve.</p><p>&nbsp;</p><p><strong>Employees who join SimVentions will enjoy additional perks like:</strong></p><ul><li><strong>Employee Ownership:</strong>&nbsp;Work with the best and help build YOUR company!</li><li><strong>Family focus:</strong>&nbsp;Work for a team that recognizes the importance of family time.</li><li><strong>Culture:</strong>&nbsp;Add to our culture of technical excellence and collaboration.</li><li><strong>Dress code:</strong>&nbsp;Business casual, we like to be comfortable while we work.</li><li><strong>Resources:</strong>&nbsp; Excellent facilities, tools, and training opportunities to grow in your field.</li><li><strong>Open communication:</strong>&nbsp;Work in an environment where your voice matters.</li><li><strong>Corporate Fellowship:</strong>&nbsp; Opportunities to participate in company sports teams and employee-led interest groups for personal and professional development.</li><li><strong>Employee Appreciation:&nbsp;</strong>Multiple corporate events throughout the year, including Holiday Events, Company Picnic, Imagineering Day, and more.</li><li><strong>Founding Partner of the FredNats Baseball team:</strong>&nbsp;Equitable distribution of tickets for every home game to be enjoyed by our employee-owners and their families from our private suite.</li><li><strong>Food:</strong>&nbsp;We have a lot of food around here!</li></ul><p>FTAC</p><p>&nbsp;</p></p>",
      "name": "Cybersecurity Engineer lll - 90k - 160k/annually",
      "type": "external",
      "publication_date": "2025-07-13T21:48:44Z",
      "short_name": "cybersecurity-engineer-lll-90k-160kannually-62a18e",
      "model_type": "jobs",
      "id": 19045021,
      "locations": [
        {
          "name": "Rancho Penasquitos, CA"
        }
      ],
      "categories": [
        {
          "name": "Software Engineering"
        }
      ],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/simventionsincglassdoor46/cybersecurity-engineer-lll-90k-160kannually-62a18e"
      },
      "company": {
        "id": 15000709,
        "short_name": "simventionsincglassdoor46",
        "name": "SimVentions, Inc - Glassdoor ✪ 4.6"
      }
    },
    {
      "contents": "<div><p><b>Administrative Assistant - Sales</b></p><p><b>Corporate Headquarters</b></p><p><b>12575 Uline Drive,&nbsp;Pleasant Prairie, WI 53158</b></p><p></p><p>Are you a “doer” that enjoys supporting people and delivering an excellent experience? Then you belong at Uline as an Administrative Assistant to support management and staff for our Corporate Sales team.</p><p></p><p><b>Careers Packed with Potential. </b>Backed by 45+ years of success, Uline offers opportunities to grow your career with stability you can count on.</p><p></p><p><b>Position Responsibilities</b></p></div>\n\n<div><div><div><div><div><div><div><div><ul><li><p>Provide administrative support to Uline’s Corporate Sales team.</p></li><li><p>Plan and schedule department travel and coordinate meetings / site visits.</p></li><li><p>Run reports, queries and prepare presentations.</p></li><li><p>Maintain and update department documentation, processes and procedures.</p></li><li><p>Manage multiple department calendars.</p></li></ul><p></p><p><b>Minimum Requirements</b></p><ul><li><p>High school degree or equivalent. &nbsp;Bachelor’s degree <b>preferred.</b></p></li><li><p>2+ years of administrative / clerical experience <b>p</b><b>referred.</b></p></li><li><p>Proficient in Microsoft Office products.</p></li><li><p>Extremely organized with strong time-management skills.</p></li><li><p>Ability to maintain confidentiality when dealing with sensitive information.</p></li></ul><p></p><p><b>Benefits</b></p><ul><li><p>Complete health insurance coverage and 401(k) with 6% employer match that <u>starts day one</u>!</p></li><li><p>Multiple bonus programs.</p></li><li><p>Paid holidays and generous paid time off.</p></li><li><p>Tuition Assistance Program that covers professional continuing education.</p></li></ul><p></p><p><b>Employee Perks</b></p><ul><li><p>On-site café and first-class fitness center with complimentary personal trainers.</p></li><li><p>Over four miles of beautifully maintained walking trails.</p></li></ul><p></p><p><b>About Uline</b></p><p></p><p>Uline, a family-owned company, is North America’s leading distributor of shipping, industrial, and packaging materials with over 9,000 employees across 14 locations and 15 sales offices.</p><p></p><p>Uline is a&nbsp;<u>drug-free workplace</u>. All positions are on-site.</p><p></p><p>EEO/AA Employer/Vet/Disabled</p><p></p><p>#LI-AR1</p><p>#CORP</p><p>(#IN-PPOFC)</p></div></div></div></div></div></div></div></div>",
      "name": "Administrative Assistant - Sales",
      "type": "external",
      "publication_date": "2025-07-13T09:52:33Z",
      "short_name": "administrative-assistant-sales-68f3e0",
      "model_type": "jobs",
      "id": 19518812,
      "locations": [
        {
          "name": "Oak Park, IL"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/ulineinc/administrative-assistant-sales-68f3e0"
      },
      "company": {
        "id": 15000556,
        "short_name": "ulineinc",
        "name": "Uline, Inc."
      }
    },
    {
      "contents": "<div><p><b><span>Now Hiring!&nbsp;</span></b><span>&nbsp;</span></p></div>\n\n<div><p><b><span>Sleep Expert</span><span> – </span><span>Sales&nbsp;</span></b><span>&nbsp;</span></p></div>\n\n<div><p><span>&nbsp;</span></p></div>\n\n<div><p><b><span>Is your current job a nightmare? Make it a dream!</span></b><span>&nbsp;</span></p></div>\n\n<div><p><b><span>Mattress Firm</span></b><span>&nbsp;</span></p></div>\n\n<div><p><b><span>The most trusted authority on sleep</span></b><span>&nbsp;</span></p></div>\n\n<div><p><span><span>We’re</span><span> no ordinary mattress company. </span><span>In just over 30 years, </span><span>Mattress Firm has</span><span> become America’s </span><span>largest</span><span> specialty mattress retailer. With more than 2,400 stores nationwide and a team of more than 6,000</span><span> </span><span>Sleep Experts</span></span><span><span>®</span><span>, we</span></span><span><span> have helped millions of people get better sleep.</span><span> </span></span><span><span>That’s</span><span> who we are and what we do</span><span>—because everyone deserves a great night’s sleep.</span></span><span>&nbsp;</span></p></div>\n\n<div><p><span>&nbsp;</span></p></div>\n\n<div><p><b><span>Helping</span><span> people sleep </span><span>well</span><span> </span><span>so they</span><span> live </span><span>well</span></b><span>&nbsp;</span></p></div>\n\n<div><p><span><span>Did you know </span><span>we</span><span> spend a third of </span><span>our lives </span><span>in bed? </span><span>That’s</span><span> why our priority is making sure everyone’s </span><span>eight</span><span> hours are perfect. </span></span><span><span>We’re</span><span> looking for passionate, ambitious people: </span></span><span><span>innovators</span><span>, </span><span>a</span><span>ction takers</span><span>, growth seekers and </span><span>life changers</span><span>. </span><span>Your journey will begin with an extensive, customer-centric retail sales training program that empowers you to </span><span>create a life-changing in-store experience and </span><span>help customers build the perfect sleep sanctuary.</span><span> Helping people sleep </span><span>well </span><span>so</span><span> they</span><span> live </span><span>well </span><span>is at the core of what we do. </span><span>The right mattress matters, and so does the right career.&nbsp;</span></span><span>&nbsp;</span></p></div>\n\n<div><div><p><span>&nbsp;</span></p></div><div><p><b><span>Why work for </span><span>Mattress</span><span> Firm?</span></b><span>&nbsp;</span></p></div><div><ul><li><p><span><span>Our teams are</span><span> </span><span>passionate,</span><span> and our culture is inspiring</span></span><span>&nbsp;</span></p></li></ul></div><div><ul><li><p><span><span>You’ll</span><span> be surrounded by</span><span> ambitious people: </span></span><span><span>innovators</span><span>,</span><span> action takers; life changers</span><span> that will inspire you</span></span><span>&nbsp;</span></p></li></ul></div><div><ul><li><p><span><span>Excellent growth opportunities through education and development </span><span>programs</span></span><span>&nbsp;</span></p></li></ul></div></div>\n\n<div><div><ul><li><p><span><span>Great benefits</span></span><span>&nbsp;</span></p></li></ul></div><div><ul><li><p><span><span>Get paid on demand</span><span>&nbsp;</span></span><span>&nbsp;</span></p></li><li><p><span><span>M</span><span>ental health </span><span>and life </span><span>resources</span></span><span>&nbsp;</span></p></li><li><p><span><span>Great employee discounts:</span></span><span>&nbsp;</span></p></li></ul></div><div><ul><li><p><span><span>mattresses </span><span>and</span><span> sleep accessories</span></span><span>&nbsp;</span></p></li></ul></div></div>\n\n<div><div><ul><li><p><span><span>cell phones </span><span>and</span><span> electronics</span></span><span>&nbsp;</span></p></li><li><p><span><span>travel</span></span><span>&nbsp;</span></p></li><li><p><span><span>car and home loans</span></span><span>&nbsp;</span></p></li><li><p><span><span>and more</span></span><span>&nbsp;</span></p></li></ul></div><div><ul><li><p><span><span>Medical, dental, </span><span>prescription, </span><span>and </span><span>vision</span><span> plans</span></span><span>&nbsp;</span></p></li></ul></div></div>\n\n<div><div><ul><li><p><span><span>401(k)</span><span> with employer matching</span></span><span>&nbsp;</span></p></li><li><p><span><span>Some positions have base </span><span>pay </span><span>or</span><span> uncapped commission</span></span><span>&nbsp;</span></p></li></ul></div><div><p><span>&nbsp;</span></p></div><div><p><b><span>Job </span><span>Description</span></b><span>&nbsp;</span></p></div><div><p><span><span>The Sleep Expert will elevate and enhance the customer's in-store experience by being a trusted sleep authority and offering best-in-class product</span><span>s</span><span>. </span><span>Sleep </span><span>Experts will execute </span><span>the Mattress Firm </span><span>selling programs and support a seamless omni-channel experience to create a compelling and engaging environment that puts the customer at the center.</span></span><span>&nbsp;</span></p></div></div>\n\n<div><div><p><span>&nbsp;</span></p></div><div><ul><li><p><span>&nbsp;</span><span>Create an environment where the customer is always at the center by cultivating strong relationships&nbsp;</span></p></li><li><p><span>Provide technical and product knowledge information to customers, serve as subject matter expert</span><span>&nbsp;</span></p></li><li><p><span>Drive individual sales performance and KPIs while demonstrating company values and supporting company initiatives&nbsp;</span><span>&nbsp;</span></p></li><li><p><span><span>Execute current visual merchandising and POP standards</span></span><span>&nbsp;</span></p></li></ul></div></div>\n\n<div><div><ul><li><p><span><span>Adhere to </span><span>c</span><span>ompany merchandising and marketing programs to standard</span></span><span>&nbsp;</span></p></li><li><p><span><span>Follow </span><span>c</span><span>ompany policy and execute </span><span>c</span><span>ompany standards on appearance and functionality</span></span><span>&nbsp;</span></p></li><li><p><span><span>Maintain customer relationships during and post-purchase (e.g., resolving issues, deliver reminders, resolving concerns etc.)</span></span><span>&nbsp;</span></p></li><li><p><span><span>Seek</span><span> and accept constructive feedback for continuous personal, professional and performance development</span></span><span>&nbsp;</span></p></li><li><p><span><span>Continue to develop skills, competencies, product knowledge through assigned course work, training and other company led activities</span></span><span>&nbsp;</span></p></li></ul></div></div>\n\n<div><div><ul><li><p><span><span>Maintain awareness of competition, advertisements and services offered, develop strategies to counter</span></span><span>&nbsp;</span></p></li><li><p><span><span>Leverage social media to positively </span><span>impact</span><span> brand awareness and increase sales</span></span><span>&nbsp;</span></p></li><li><p><span><span>Ensure </span><span>timely</span><span> open and closing procedures</span></span><span>&nbsp;</span></p></li><li><p><span><span>Follow all Company procedures on cash handling including acceptance of payment and deposit processes</span></span><span>&nbsp;</span></p></li><li><p><span><span>Ability to push and pull and </span><span>lift up</span><span> to </span><span>50</span><span> pounds to </span><span>assist</span><span> customers with load outs and in store purchases</span></span><span>&nbsp;</span></p></li></ul></div></div>\n\n<div><div><ul><li><p><span><span>Adhere to all sales processing policies to ensure the proper creation and execution of customer invoicing</span></span><span>&nbsp;</span></p></li><li><p><span><span>Professional communication and representation of </span><span>c</span><span>ompany brand in all internal and external interactions</span></span><span>&nbsp;</span></p></li><li><p><span><span>Complete all required training modules and certifications prior to the due date</span></span><span>&nbsp;</span></p></li><li><p><span><span>Ensure all safety policies and procedures are followed to </span><span>maintain</span><span> a safe work environment for all</span></span><span>&nbsp;</span></p></li><li><p><span><span>Communicate professionally with all internal and external contacts</span></span><span>&nbsp;</span></p></li></ul></div></div>\n\n<div><div><ul><li><p><span><span>Follow all Company policies and execute company standards on appearance and functionality as well as </span><span>appropriate brand</span><span> representation</span></span><span>&nbsp;</span></p></li><li><p><span><span>Communicates any concerns or issues to leadership to ensure proper efficiency of department and company operations</span></span><span>&nbsp;</span></p></li></ul></div><div><p><span>&nbsp;</span></p></div><div><p><b><span>Life at Mattress Firm</span></b><span>&nbsp;</span></p></div><div><p><b><span>Our </span><span>m</span><span>ission </span><span>and</span><span> </span><span>v</span><span>ision</span></b><span>&nbsp;</span></p></div></div>\n\n<div><p><span><span>As America’s most trusted authority on sleep, </span><span>our mission is to help</span><span> people </span><span>find the mattress of their dreams</span><span>. With low prices</span><span>, the best </span><span>brands</span><span> and the knowledge of our Sleep Experts®</span><span>, </span><span>we make it easy to get a great night’s sleep, every night.</span></span><span>&nbsp;</span></p></div>\n\n<div><p><b><span>History</span></b><span>&nbsp;</span></p></div>\n\n<div><p><span><span>In just over 30 years, </span><span>Mattress Firm has</span><span> become America’s </span><span>largest</span><span> specialty mattress retailer. With more than 2,400 stores nationwide and a team of more than 6,000</span><span> </span><span>Sleep Experts</span></span><span><span>®, we</span></span><span><span> have helped millions of people get better sleep.&nbsp;</span></span><span>&nbsp;</span></p></div>\n\n<div><p><b><span>Benefits beyond a paycheck</span></b><span>&nbsp;</span></p></div>\n\n<div><p><span><span>We support you just like we support our customers—</span><span>that’s</span><span> why we offer an</span><span> extensive range of benefits designed to support you, your family, and your future.</span></span><span>&nbsp;</span></p></div>\n\n<div><p><b><span>Diversity, </span><span>equity</span><span> </span><span>and</span><span> inclusion</span></b><span>&nbsp;</span></p></div>\n\n<div><p><span><span>We believe in an inclusive</span><span> </span><span>environment</span><span> that attracts, </span><span>develops</span><span> and </span><span>retains</span><span> top talent</span><span>. </span><span>Our Diversity, Equity &amp; Inclusion Council </span><span>works to promote</span><span> the cultivation of </span><span>a</span><span> work environment that embraces and celebrates all</span><span> the</span><span> individuals, backgrounds and perspectives</span><span> that reflect the communities we serve.</span><span>&nbsp;</span></span><span>&nbsp;</span></p></div>\n\n<div><p><b><span>Giving back to our community</span></b><span>&nbsp;</span></p></div>\n\n<div><p><span><span>Whether </span><span>it’s</span><span> volunteering at a foster care agency, food bank</span><span> </span><span>or even an animal shelter, </span><span>w</span><span>e believe in giving back to our associates and the communities they live and work in. </span><span>That's</span><span> why </span><span>we're</span><span> proud to support organizations dedicated to helping people follow their dreams and thrive.</span></span><span>&nbsp;</span></p></div>\n\n<div><p><b><span>DIVERSE CANDIDATES ARE ENCOURAGED TO APPLY</span></b><span>&nbsp;</span></p></div>\n\n<div><p><span><span>Mattress Firm is an equal employment opportunity employer and is committed to maintaining a non-discriminatory work environment and does not discriminate against any applicant or employee for employment on the basis of race, color, religion, sex, national origin, age, disability, veteran status, marital status, sexual orientation, gender identity, or any other characteristic protected by applicable law. Mattress Firm is committed to creating a dynamic work environment that values diversity and inclusion, respect and integrity, customer focus, and innovation.</span></span><span>&nbsp;</span></p></div>\n\n<p></p>\n\n<p></p>\n\n<p>Pay Range:</p>\n\n<p>55,000-75,000<p></p><p></p><p></p><p><span>Now don’t fall asleep out there… the sooner that we receive your application, the closer you are to the career of your dreams!</span></p><p></p><p></p><p><b>DIVERSE CANDIDATES ARE ENCOURAGED TO APPLY</b></p><p></p><p>Mattress Firm is an equal employment opportunity employer and is committed to maintaining a non-discriminatory work environment, and does not discriminate against any applicant or employee for employment on the basis of race, color, religion, sex, national origin, age, disability, veteran status, marital status, sexual orientation, gender identity, or any other characteristic protected by applicable law. Mattress Firm is committed to creating a dynamic work environment that values diversity and inclusion, respect and integrity, customer focus, and innovation.</p></p>",
      "name": "Sleep Expert - Sales",
      "type": "external",
      "publication_date": "2025-07-13T09:58:39Z",
      "short_name": "sleep-expert-sales-345458",
      "model_type": "jobs",
      "id": 19465685,
      "locations": [
        {
          "name": "Charleston, SC"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/mattressfirm/sleep-expert-sales-345458"
      },
      "company": {
        "id": 15000576,
        "short_name": "mattressfirm",
        "name": "Mattress Firm"
      }
    },
    {
      "contents": "<div><p>SpaceX was founded under the belief that a future where humanity is out exploring the stars is fundamentally more exciting than one where we are not. Today SpaceX is actively developing the technologies to make this possible, with the ultimate goal of&nbsp;enabling human life on Mars.</p></div>\n\n<p><strong>SR. HARDWARE / INFRASTRUCTURE SITE RELIABILITY ENGINEER (STARLINK)</strong></p>\n\n<p>At SpaceX we’re leveraging our experience in building rockets and spacecraft to deploy Starlink, the world’s most advanced broadband internet system. Starlink is the world’s largest satellite constellation and is providing fast, reliable internet to 5M+ users worldwide. We design, build, test, and operate all parts of the system – thousands of satellites, consumer receivers that allow users to connect within minutes of unboxing, and the software that brings it all together. We’ve only begun to scratch the surface of Starlink’s potential global impact and are looking for best-in-class engineers to help maximize Starlink’s utility for communities and businesses around the globe.&nbsp;</p>\n\n<p><span>As an engineer focused on Starlink’s software and network infrastructure, you will design, operate and scale the infrastructure we use to run the world’s largest satellite constellation and manage a network that handles millions of daily users worldwide. These positions cover a variety of areas ranging from Site Reliability Engineering, to Developer Operations, to our internal Kubernetes platforms. You will develop automation to deploy and manage on-premise compute resources, create highly scalable and maintainable software products, and directly collaborate with engineering across the board.</span></p>\n\n<p><strong>RESPONSIBILITES:</strong></p>\n\n<ul>\n<li>Develop automation to deploy and manage on-premise compute resources</li>\n<li>Deploy and manage core infrastructure such as databases, monitoring and distributed storage</li>\n<li>Closely collaborate with software engineers to create highly scalable, operable and maintainable products</li>\n<li>Engage in and improve the whole lifecycle of hardware -- from inception and design, through deployment, operation, scaling and retirement</li>\n<li>Invent tools and processes that enable fast, accurate, and easy-to-use development and deployment systems</li>\n<li>Hands-on integration and troubleshooting across the entire Starlink stack&nbsp;</li>\n<li>Create and manage core infrastructure such as databases and software libraries</li>\n<li>Identify areas for improvement and create innovative solutions that enable high developer velocity</li>\n</ul>\n\n<p><strong>BASIC QUALIFICATIONS:</strong></p>\n\n<ul>\n<li>Bachelor’s degree in computer science, information systems/IT, or an engineering discipline and 5+ years of professional experience in systems administration, site reliability engineering, or DevOps; OR 7+ years of professional experience in systems administration, site reliability engineering, or DevOps in lieu of a degree</li>\n<li>2+ years of professional experience with Linux operating systems</li>\n<li>Experience with Terraform, Ansible, or other infrastructure tools</li>\n<li>Experience with containerization technologies (i.e. Docker, Kubernetes)</li>\n<li>Experience in Bash, Python, and/or other scripting languages</li>\n<li>Development experience in Python, Go, C++, or C</li>\n</ul>\n\n<p><strong>PREFERRED SKILLS AND EXPERIENCE:</strong></p>\n\n<ul>\n<li>3+ years of experience with Python and Python-based development frameworks</li>\n<li>Strong understanding of operating systems, virtualization, and hypervisor technologies</li>\n<li>Knowledge of Linux boot process and systems configuration</li>\n<li>Deep understanding of testing, continuous integration, build, deployment &amp; monitoring</li>\n<li>Focus on performance bottlenecks and performance improvement techniques</li>\n<li>Experience with automatically managing dozens, hundreds, or thousands of servers</li>\n<li>Strong networking knowledge of TCP/IP</li>\n<li>Excellent communications skills with the ability to communicate with customers, peers, management etc. in both formal and informal situations</li>\n</ul>\n\n<p><strong>ADDITIONAL REQUIREMENTS:</strong></p>\n\n<ul>\n<li>Must be willing to work extended hours and weekends as needed</li>\n</ul>\n\n<p><strong>COMPENSATION AND BENEFITS: &nbsp; &nbsp;</strong><br>&nbsp; &nbsp;&nbsp;<br>Pay range: &nbsp; &nbsp;<br>Software Engineer/Senior: $160,000.00 - $220,000.00/per year &nbsp; &nbsp;</p>\n\n<p>Your actual level and base salary will be determined on a case-by-case basis and may vary based on the following considerations: job-related knowledge and skills, education, and experience.</p>\n\n<p>Base salary is just one part of your total rewards package at SpaceX. You may also be eligible for long-term incentives, in the form of company stock, stock options, or long-term cash awards, as well as potential discretionary bonuses and the ability to purchase additional stock at a discount through an Employee Stock Purchase Plan. You will also receive access to comprehensive medical, vision, and dental coverage, access to a 401(k)-retirement plan, short and long-term disability insurance, life insurance, paid parental leave, and various other discounts and perks. You may also accrue 3 weeks of paid vacation and will be eligible for 10 or more paid holidays per year. Exempt employees are eligible for 5 days of sick leave per year. Company shuttles are offered to employees for round trip travel from select Seattle locations to the SpaceX Redmond office Monday to Friday.&nbsp;</p>\n\n<div><p><strong>ITAR REQUIREMENTS:</strong></p>\n<ul>\n<li>To conform to U.S. Government export regulations, applicant must be a (i) U.S. citizen or national, (ii) U.S. lawful, permanent resident (aka green card holder), (iii) Refugee under 8 U.S.C. § 1157, or (iv) Asylee under 8 U.S.C. § 1158, or be eligible to obtain the required authorizations from the U.S. Department of State. Learn more about the ITAR <a href=\"https://www.pmddtc.state.gov/?id=ddtc_kb_article_page&amp;sys_id=24d528fddbfc930044f9ff621f961987\" rel=\"noopener noreferrer\">here</a>. &nbsp;</li>\n</ul>\n<p>SpaceX is an Equal Opportunity Employer; employment with SpaceX is governed on the basis of merit, competence and qualifications and will not be influenced in any manner by race, color, religion, gender, national origin/ethnicity, veteran status, disability status, age, sexual orientation, gender identity, marital status, mental or physical disability or any other legally protected status.</p>\n<p>Applicants wishing to view a copy of SpaceX’s Affirmative Action Plan for veterans and individuals with disabilities, or applicants requiring reasonable accommodation to the application/interview process should reach out to&nbsp;<a href=\"mailto:EEOCompliance@spacex.com\" rel=\"noopener noreferrer\">EEOCompliance@spacex.com</a><em>.&nbsp;</em></p></div>",
      "name": "Sr. Hardware / Infrastructure Site Reliability Engineer (Starlink)",
      "type": "external",
      "publication_date": "2025-05-27T23:35:56Z",
      "short_name": "sr-hardware-infrastructure-site-reliability-engineer-starlink-d1e470",
      "model_type": "jobs",
      "id": 19092989,
      "locations": [
        {
          "name": "Redmond, WA"
        }
      ],
      "categories": [
        {
          "name": "Software Engineering"
        }
      ],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/spacex/sr-hardware-infrastructure-site-reliability-engineer-starlink-d1e470"
      },
      "company": {
        "id": 15000190,
        "short_name": "spacex",
        "name": "SpaceX"
      }
    },
    {
      "contents": "<div>\n Safety-Kleen in Sylmar, CA is seeking a Driver Operations Manager (Service Delivery Manager) manage the daily completion of routes by motivating and directing team members; as well as ensuring a high level of customer satisfaction. This role does this while still having a strong operational adherence to all DOT, EPA, State and Local Regulations and Safety-Kleen Policies and Procedures.\n</div>\n\n<div>\n <br> \n</div>\n\n<div>\n Safety-Kleen, a subsidiary of Clean Harbors is the leading provider of environmental, energy and industrial services throughout the United States, Canada, Mexico and Puerto Rico.  Everywhere industry meets environment, Clean Harbors is on-site, providing premier environmental, energy and industrial services. We are solving tough problems through innovation and proven methodology – come be part of the solution with us.\n</div>\n\n<div>\n <br> \n</div>\n\n<div>\n <strong>Why work for Clean Harbors?</strong>\n</div>\n\n<div>\n <ul>\n  <li>Health and Safety is our #1 priority and we live it 3-6-5!</li>\n  <li>Focus on maintaining sustainability and cleaning the Earth </li>\n  <li>Recruiting Pay range $75k-$80k </li>\n  <li>Comprehensive health benefits coverage after 30 days of full-time employment including 401K with Company match</li>\n  <li>Own part of the company with our Employee Stock Purchase Plan</li>\n  <li>Opportunities for growth and development for all the stages of your career</li>\n  <li>Company paid training and tuition reimbursement</li>\n </ul>\n</div>\n\n<div>\n <ul>\n  <li>Ensure Health and Safety is the number one priority by complying with all safe work practices, policies, and processes and always acting in a safe manner</li>\n  <li>Train, develop, and manage sales and service route drivers</li>\n  <li>Manage flow of service requests to ensure customers are serviced in a timely and efficient manner</li>\n  <li>Conduct End-of-day Check-In / Morning Check-Out process with drivers to ensure daily expectations are met and employees are prepared for the day</li>\n  <li>Fulfill duties of route driver when s/he is absent</li>\n  <li>Provide field coaching and sales training to route drivers</li>\n  <li>Meet with customers periodically to discuss needs</li>\n  <li>Increase sales portfolio by identifying opportunities</li>\n  <li>Schedule services to prevent and resolve route issues and complaints</li>\n  <li>Ensure completion and organization of all mandated paperwork and files.</li>\n  <li>Follow all local, state (provincial) and federal compliance regulations and rules</li>\n  <li>Safely operate vehicles in accordance with U.S. DOT, local, state (provincial) and federal requirements</li>\n  <li>Safely observe all corporate operating guidelines and procedures</li>\n  <li>Observe all company environmental health and safety operating guidelines</li>\n  <li>Perform other duties as assigned</li>\n </ul>\n</div>\n\n<div>\n <ul>\n  <li>Class B CDL</li>\n  <li>Obtain Hazmat and Tanker endorsements within 90 days of employment</li>\n  <li>Leadership experience</li>\n  <li>Intermediate computer skills</li>\n  <li>Excellent customer service skills </li>\n  <li>Excellent organization and attention to detail</li>\n  <li>Perform physical functions per job requirements</li>\n  <li>Successfully complete a background check, drug test, and physical, by position</li>\n </ul>\n</div>\n\n<div>\n <strong>Preferred Qualifications:</strong>\n</div>\n\n<div>\n <ul>\n  <li>Previous route driver experience</li>\n  <li>Previous dispatch/logistics experience</li>\n </ul>\n</div>\n\n<div>\n <br> \n</div>\n\n<div>\n Clean Harbors is an equal opportunity employer. We do not discriminate against applicants due to race, ancestry, color, sexual orientation, gender identity, national origin, religion, age, physical or mental disability, veteran status, or based on any other federal, state/provincial, or local protected class. \n</div>\n\n<div>\n <br> \n</div>\n\n<div>\n Clean Harbors is a Military &amp; Veteran friendly company.\n</div>\n\n<div>\n *SK\n</div>\n\n<div>\n <br> \n</div>",
      "name": "Service Delivery Manager",
      "type": "external",
      "publication_date": "2025-03-01T10:22:33Z",
      "short_name": "service-delivery-manager-c0389a",
      "model_type": "jobs",
      "id": 17767489,
      "locations": [
        {
          "name": "Santa Monica, CA"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/cleanharbors/service-delivery-manager-c0389a"
      },
      "company": {
        "id": 15000557,
        "short_name": "cleanharbors",
        "name": "Clean Harbors"
      }
    },
    {
      "contents": "<p><b>Associate Product Manager<br>Corporate Headquarters<br>12575 Uline Drive, Pleasant Prairie, WI 53158</b></p>\n\n<p></p>\n\n<p>We're passionate about our products because our customers rely on them to run their businesses. Manage your own product line and watch it grow!</p>\n\n<p></p>\n\n<p><b>Better together!&nbsp;</b>This position is on-site, and we are looking for people who share our passion.</p>\n\n<p></p>\n\n<p><b>Position Responsibilities</b></p>\n\n<ul><li><p>Become an expert in a given product category.</p></li><li><p>Research and source new products from domestic and international vendors.</p></li><li><p>Visit vendors and attend product tradeshows to increase knowledge of manufacturing processes and market trends.</p></li><li><p>Provide product recommendations after reviewing competitors’ offerings, customer comments, and market trends.</p></li><li><p>Participate in vendor meetings and lead some negotiation sessions.</p></li><li><p>Assist in the catalog layout preparation processes and strategize with Product Manager on new product placement within the catalog.</p></li><li><p>Seek creative methods to increase company profitability, product quality, and efficiency.</p></li><li><p>Collaboratively work with the Purchasing, Creative, Quality Control, Compliance, and Pricing teams.</p></li><li><p>Mentor and train Marketing Associates.</p></li></ul>\n\n<p></p>\n\n<p><b>Minimum Requirements</b></p>\n\n<ul><li><p>Bachelor's degree.</p></li><li><p>2 to 5 years of experience in Product Management, Supply Chain, or Marketing.</p></li><li><p>Proficient in Microsoft Office, especially Excel.</p></li><li><p>Persuasive written and verbal communicator.</p></li><li><p>Organized and analytical, with relentless attention to detail.</p></li></ul>\n\n<p></p>\n\n<p><b>Benefits</b></p>\n\n<ul><li><p>Complete health insurance coverage and 401(k) with 6% employer match that <u>starts day one</u>!</p></li><li><p>Multiple bonus programs.</p></li><li><p>Paid holidays and generous paid time off.</p></li><li><p>Tuition Assistance Program that covers professional continuing education.</p></li></ul>\n\n<p></p>\n\n<p><b>Employee Perks</b></p>\n\n<ul><li><p>On-site café and first-class fitness center with complimentary personal trainers.</p></li><li><p>Over four miles of beautifully maintained walking trails.</p></li></ul>\n\n<p></p>\n\n<p><b>About Uline</b></p>\n\n<p></p>\n\n<p>Uline, a family-owned company, is North America’s leading distributor of shipping, industrial, and packaging materials with over 9,000 employees across 13 locations.</p>\n\n<p></p>\n\n<p>Uline is a&nbsp;<u>drug-free workplace</u>.</p>\n\n<p></p>\n\n<p>EEO/AA Employer/Vet/Disabled</p>\n\n<p></p>\n\n<p>#LI-LA1</p>\n\n<p>#CORP</p>\n\n<p>(#IN-PPMER)</p>",
      "name": "Associate Product Manager",
      "type": "external",
      "publication_date": "2025-07-10T15:49:26Z",
      "short_name": "associate-product-manager-b8d4a1",
      "model_type": "jobs",
      "id": 19321582,
      "locations": [
        {
          "name": "Silver Lake, WI"
        }
      ],
      "categories": [
        {
          "name": "Product Management"
        }
      ],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/ulineinc/associate-product-manager-b8d4a1"
      },
      "company": {
        "id": 15000556,
        "short_name": "ulineinc",
        "name": "Uline, Inc."
      }
    },
    {
      "contents": "<div><p>SpaceX was founded under the belief that a future where humanity is out exploring the stars is fundamentally more exciting than one where we are not. Today SpaceX is actively developing the technologies to make this possible, with the ultimate goal of&nbsp;enabling human life on Mars.</p></div>\n\n<p><strong>DEBURR TECHNICIAN (RAPTOR PRODUCTION MACHINING)&nbsp;</strong></p>\n\n<p>Candidates should possess a combination of solid mechanical knowledge, hands-on experience and the willingness and ability to learn. The propulsion technician is responsible for manufacturing, assembly, and testing of rocket hardware and associated sub-assemblies. This is a dynamic position that requires the flexibility to work on different systems, the ability to troubleshoot anomalies, and the ability to work autonomously on defined schedules while keeping safety and quality at the forefront of everything that is done.</p>\n\n<p><strong>RESPONSIBILITIES:</strong></p>\n\n<ul>\n<li>Grind, file, or sand surfaces of metal items, utilizing a variety of hand tools, power tools, and machines</li>\n<li>Chase machine cut threads to size</li>\n<li>Polish tight tolerance surface finishes</li>\n<li>Wash parts that have gone through deburr process</li>\n<li>Inspect surface finishes, threads, and broken edges</li>\n<li>Remove defects and smooth uneven surfaces</li>\n<li>Use tools and fluid flow to remove chips/debris from passages in parts</li>\n<li>Borescope parts to check for internal defects and debris</li>\n</ul>\n\n<p><strong>BASIC QUALIFICATIONS:</strong></p>\n\n<ul>\n<li>High school diploma or equivalency certificate</li>\n<li>1+ years of professional work experience in a factory or production environment</li>\n</ul>\n\n<p><strong>PREFERRED SKILLS AND EXPERIENCE:</strong></p>\n\n<ul>\n<li>Able to bench close tolerance dimensions within what the blueprint calls for</li>\n<li>Experience utilizing various measuring instruments: mics, veneers, ultra-sonic thickness gauges, etc.</li>\n<li>Experience with lean manufacturing and 5S organizational methods</li>\n<li>Able to utilize various grinding equipment: angle head grinders, pencil grinders, straight grinders, and palm sanders</li>\n<li>Experience using digital borescopes for visual inspection</li>\n</ul>\n\n<p><strong>ADDITIONAL REQUIREMENTS:</strong></p>\n\n<ul>\n<li>Available for overtime and weekend hours</li>\n<li>Must be available for 1st shift (5:00 AM – 3:30 PM)</li>\n<li>Capable of lifting up to 50lbs without accommodation</li>\n<li>Capable of standing and kneeling without accommodation</li>\n</ul>\n\n<p><strong>COMPENSATION AND BENEFITS:&nbsp;</strong></p>\n\n<p>Pay range: &nbsp; &nbsp;<br>Technician /Level 1: $22.00 - $24.00/hour &nbsp; &nbsp;<br>Technician /Level 2: $24.00 - $27.00/hour &nbsp; &nbsp;<br>Technician /Level 3: $26.50 - $30.00/hour &nbsp; &nbsp;</p>\n\n<p>Your actual level and base salary will be determined on a case-by-case basis and may vary based on the following considerations: job-related knowledge and skills, education, and experience.</p>\n\n<p>Base salary is just one part of your total rewards package at SpaceX. You may also be eligible for long-term incentives, in the form of company stock, stock options, or long-term cash awards, as well as potential discretionary bonuses and the ability to purchase additional stock at a discount through an Employee Stock Purchase Plan. You will also receive access to comprehensive medical, vision, and dental coverage, access to a 401(k) retirement plan, short and long-term disability insurance, life insurance, paid parental leave, and various other discounts and perks. You may also accrue 3 weeks of paid vacation and will be eligible for 10 or more paid holidays per year.</p>\n\n<div><p><strong>ITAR REQUIREMENTS:</strong></p>\n<ul>\n<li>To conform to U.S. Government export regulations, applicant must be a (i) U.S. citizen or national, (ii) U.S. lawful, permanent resident (aka green card holder), (iii) Refugee under 8 U.S.C. § 1157, or (iv) Asylee under 8 U.S.C. § 1158, or be eligible to obtain the required authorizations from the U.S. Department of State. Learn more about the ITAR <a href=\"https://www.pmddtc.state.gov/?id=ddtc_kb_article_page&amp;sys_id=24d528fddbfc930044f9ff621f961987\" rel=\"noopener noreferrer\">here</a>. &nbsp;</li>\n</ul>\n<p>SpaceX is an Equal Opportunity Employer; employment with SpaceX is governed on the basis of merit, competence and qualifications and will not be influenced in any manner by race, color, religion, gender, national origin/ethnicity, veteran status, disability status, age, sexual orientation, gender identity, marital status, mental or physical disability or any other legally protected status.</p>\n<p>Applicants wishing to view a copy of SpaceX’s Affirmative Action Plan for veterans and individuals with disabilities, or applicants requiring reasonable accommodation to the application/interview process should reach out to&nbsp;<a href=\"mailto:EEOCompliance@spacex.com\" rel=\"noopener noreferrer\">EEOCompliance@spacex.com</a><em>.&nbsp;</em></p></div>",
      "name": "Deburr Technician (Raptor Production Machining) ",
      "type": "external",
      "publication_date": "2025-05-19T23:35:15Z",
      "short_name": "deburr-technician-raptor-production-machining",
      "model_type": "jobs",
      "id": 18306893,
      "locations": [
        {
          "name": "El Segundo, CA"
        }
      ],
      "categories": [
        {
          "name": "Manufacturing and Warehouse"
        }
      ],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/spacex/deburr-technician-raptor-production-machining"
      },
      "company": {
        "id": 15000190,
        "short_name": "spacex",
        "name": "SpaceX"
      }
    },
    {
      "contents": "<p>Inizio Engage has partnered with Tonix Pharmaceuticals and are seeking performance-driven, competitive, highly entrepreneurial, and analytical Regional Sales Manager who are willing to put forth discretionary effort to ensure their region meets and exceeds expectations. This is a highly innovative role requiring you to lead by example to drive district performance, think outside of the box, and continually challenge your team to go the extra mile.</p>\n\n<p></p>\n\n<p>This is your opportunity to join Inizio Engage and be part of an exciting opportunity to represent a leading biotechnology company preparing for an upcoming launch in the fibromyalgia space!</p>\n\n<p></p>\n\n<p><b>What’s in it for you?</b>&nbsp;</p>\n\n<ul><li>Competitive compensation</li><li><span><span>Excellent Benefits – accrued</span><span> time off, medical, dental, vision, 401k, disability &amp; life insurance, paid maternity and </span><span>paternity leave</span><span> benefits, employee discounts/promotions&nbsp;</span></span><span>&nbsp;</span></li><li><span><span>Employee discounts &amp; exclusive promotions</span></span><span>&nbsp;</span></li><li><span><span>Recognition programs, contests, and company-wide awards</span></span><span>&nbsp;</span></li><li><span><span>Exceptional, collaborative culture</span></span><span>&nbsp;</span></li><li><span><span>Best Places to Work in BioPharma (2022, 2023, &amp; 2024)</span></span><span>&nbsp;</span></li><li><span><span>Certified Great Place to Work (2022, 2023, 2025)</span></span><span>&nbsp;</span></li></ul>\n\n<p>​</p>\n\n<p><b>What will you be doing?</b>&nbsp;&nbsp;</p>\n\n<ul><li>Ensure that the given geography meets or exceeds all sales targets and goals</li><li>Recruit, hire, manage, and develop/coach a high performing team</li><li>Create and drive region strategy and short-term tactics to achieve business goals in a timely manner</li><li>Execute Consistent and Frequent Performance Management with Sales Team</li><li>Work in the field with sales representatives to coach and counsel on improvement of selling skills, product knowledge, and capabilities needed for successful representative development and maximum goal achievement</li><li>Monitor data analytics information (sales trends, activity, market share) continuously to ensure full utilization of available resources and tools for maximum impact on prescribing providers while constantly looking for opportunities to improve</li><li>Set a positive tone and high standard for the regional team in terms of work ethic, culture, expectations, business ethics</li><li>Assess competitive threats, best practices and field learnings and share as appropriate.</li><li>Aid in the design of business plans, employee development plans, monthly reports as required</li><li>Organize, participate in employee training, conferences, and regional meetings</li><li>Collaborate with Market Access and Patient Access on a regular basis.</li><li>Collaborate with Medical Affairs as appropriate</li><li>Drive call plan adherence and execution</li><li>Communicate with Tonix key sales leadership regularly (written and verbal)</li><li>Maintain compliance standards &nbsp;&nbsp;&nbsp;&nbsp;</li></ul>\n\n<p></p>\n\n<p><b>What do you need for this position?</b>&nbsp;</p>\n\n<ul><li>Bachelor’s degree in business, science, or related field or equivalent work experience</li><li>Ability to influence team member activities</li><li>At least 3 years of sales management experience within the Pharmaceutical, Biotechnology or Healthcare Industry is required with proven ability to develop and motivate others, lead through change, and deliver on set objectives.</li><li>Product launch experience highly preferred</li><li>Rheumatology and/or CNS experience preferred</li><li>CSO field management experience plus</li><li>Ability to recruit, retain, and develop a high-quality team</li><li>A deep understanding of the pharmaceutical and healthcare industries</li><li>Greater than 50% travel including overnights with be required</li></ul>\n\n<p></p>\n\n<p><b>About Inizio Engage</b>&nbsp;</p>\n\n<p>&nbsp;<br>Inizio Engage is a strategic, commercial, and creative engagement partner that specializes in healthcare. Our passionate, global workforce augments local expertise and diverse mix of skills with data, science, and technology to deliver bespoke engagement solutions that help clients reimagine how they engage with their patients, payers, people, and providers to improve treatment outcomes. Our mission is to partner with our clients, improving lives by helping healthcare professionals and patients get the medicines, knowledge and support they need.&nbsp;&nbsp;</p>\n\n<p></p>\n\n<p>We believe in our values: <b>We empower everyone/We rise to the challenge/We work as one/We ask what if/We do the right thing</b>, and we will ask you how your personal values align to them.</p>\n\n<p></p>\n\n<p>To learn more about Inizio Engage, visit us at:&nbsp; <a href=\"https://inizio.health/\" rel=\"noopener noreferrer\">https://inizio.health/</a>&nbsp;</p>\n\n<p></p>\n\n<p>Inizio Engage is proud to be an equal opportunity employer. Individuals seeking employment at Inizio are considered without regards to age, ancestry, color, gender, gender identity or expression, genetic information, marital status, medical condition (including pregnancy, childbirth, or related medical conditions), mental or physical disability, national origin, protected family care or medical leave status, race, religion (including beliefs and practices or the absence thereof), sexual orientation, military or veteran status, or any other characteristic protected by federal, state, or local laws.&nbsp; Further, pursuant to applicable local ordinances, Inizio will consider employment qualified applicants with arrest and conviction records.&nbsp;</p>\n\n<p></p>\n\n<p>Inizio Engage is an equal opportunity employer M/F/V/D. We appreciate your interest in our company; however, only qualified candidates will be considered.&nbsp;</p>",
      "name": "Regional Sales Manager",
      "type": "external",
      "publication_date": "2025-07-11T09:56:07Z",
      "short_name": "regional-sales-manager-697699",
      "model_type": "jobs",
      "id": 19464530,
      "locations": [
        {
          "name": "Chicago, IL"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/inizioengage/regional-sales-manager-697699"
      },
      "company": {
        "id": 15000787,
        "short_name": "inizioengage",
        "name": "Inizio Engage"
      }
    },
    {
      "contents": "<p>With a culture of recognition and reputation for excellence, ELS is the ideal organization in which to develop a long and successful career!<br><br>ELS is hiring for the position of Lifeguard-1 in Fremont, Wisconsin.<br><br><b>What you'll do:</b><br><br>The Pool Monitor patrols the pool area, enforces rules and ensures the safety of residents and their belongings. This position handles any stressful situation in a calm manner and reacts accordingly with respect to local, state and federal laws.<br><br><b>Your job will include:</b><br><br><ul><li>Supervise all activities in the pool area and monitor the facility for any issues.</li><li>Ensure that only authorized residents and their guests use the pool area.</li><li>Enforce the pool rules as stated and posted in the pool area.</li><li>Report any violations to management and contact law enforcement if necessary.</li><li>Ensure that guardians supervise children at all times.</li><li>Arrange pool furniture as needed.</li><li>Perform routine patrolling and chemical inspections.</li><li>Exercise sound judgment and make independent decisions.</li></ul><br><b>Experience &amp; skills you'll </b><b>need:</b><br><br><ul><li>High school diploma, or the equivalent.</li><li>CPR training/certification a plus.</li><li>Exceptional customer service and problem-solving skills.</li><li>High level of comfort working in a collaborative team environment.</li><li>Strong attention to detail.</li></ul><br>We invite you to visit our web site at <a href='\\\"http://www.equitylifestyleproperties.com/\\\"'>www.equitylifestyleproperties.com</a> for additional information regarding our exceptional resort communities.<br><br>As an Equal Opportunity Employer, we welcome and thank all applicants.</p>",
      "name": "Lifeguard-1",
      "type": "external",
      "publication_date": "2025-01-23T19:58:07Z",
      "short_name": "lifeguard1-77fd16",
      "model_type": "jobs",
      "id": 14607985,
      "locations": [
        {
          "name": "Neenah, WI"
        }
      ],
      "categories": [
        {
          "name": "Unknown"
        }
      ],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/equitylifestyleproperties/lifeguard1-77fd16"
      },
      "company": {
        "id": 11723,
        "short_name": "equitylifestyleproperties",
        "name": "Equity Lifestyle Properties"
      }
    },
    {
      "contents": "<div><p>We're Celonis, the global leader in Process Mining technology and one of the world's fastest-growing SaaS firms. We believe there is a massive opportunity to unlock productivity by placing data and intelligence at the core of business processes - and for that, we need you to join us.</p></div>\n\n<p><strong>The Team:</strong><strong><br></strong>The Corporate Account Executive team is responsible for the most extensive portfolio of accounts in the company. The teams are supported by the best-in-class products, with the best sales motions, and the cooperation of other departments (Value Engineers, Partner Managers and Consulting Services ).<strong> Based in Madrid</strong>, we cover EMEA and Emerging markets, and we are rapidly expanding with excellent career growth opportunities.&nbsp;</p>\n\n<p><br><strong>The Role:</strong><br>The primary objective is to land new logos and achieve the target based on ACV (Annual contract value) generated in the region. As an Account Executive you will be an integral part to our strategy for expanding market share through targeted client acquisitions.</p>\n\n<p><strong><br></strong><strong>The work you’ll do:</strong></p>\n\n<ul>\n<li>Hunt down and discover new business opportunities in your region</li>\n<li>Collaborate with partners to land new logos</li>\n<li>Interact with all levels of the target organization up to C-level</li>\n<li>Deliver best in class use case specific demos to demonstrate the value of our solutions</li>\n<li>Understand accounts’ needs and effectively communicate how Celonis will meet those needs while ensuring 100% satisfaction with all customers</li>\n<li>You will be in charge of prospecting, leading the sales cycle, forecasting the deals and closing. (end-to-end sales cycle)</li>\n<li>The Corporate Account Executive is also responsible for the customer's success and drive potential expansion</li>\n</ul>\n\n<p><strong>The qualifications you need:</strong></p>\n\n<ul>\n<li>You have a university degree or equivalent professional training&nbsp;</li>\n<li>You have relevant work experience (3+ years) in enterprise software sales</li>\n<li>You have excellent written/verbal communication skills</li>\n<li>You have ability to multitask, prioritize, and manage time effectively</li>\n<li>You have proven experience building pipeline.</li>\n<li>You have ability to take initiative</li>\n<li>You are comfortable working in a fast-paced and dynamic environment</li>\n<li>You are skilled in using relevant technology to maximize pipe generation and deal velocity</li>\n<li>You have ability to work, build and maintain relationships at all levels</li>\n<li>You are <strong>f</strong>luent in both English<strong> and Swedish or Danish<br></strong></li>\n</ul>\n\n<p>&nbsp;</p>\n\n<div><p><strong>What Celonis Can Offer You:</strong></p>\n<ul>\n<li>The unique opportunity to work with industry-leading process mining technology</li>\n<li>Investment in your personal growth and skill development (clear career paths, internal mobility opportunities, L&amp;D platform, mentorships, and more)</li>\n<li>Great compensation and benefits packages (equity (restricted stock units), life insurance, time off, generous leave for new parents from day one, and more). For intern and working student benefits, click <a href=\"https://www.celonis.com/careers/early-professionals/faqs/\" rel=\"noopener noreferrer\">here</a>.</li>\n<li>Physical and mental well-being support (subsidized gym membership, access to counseling, virtual events on well-being topics, and more)</li>\n<li>A global and growing team of Celonauts from diverse backgrounds to learn from and work with</li>\n<li>An open-minded culture with innovative, autonomous teams</li>\n<li>Business Resource Groups to help you feel connected, valued and seen (Black@Celonis, Women@Celonis, Parents@Celonis, Pride@Celonis, Resilience@Celonis, and more)</li>\n<li>A clear set of <a href=\"https://www.celonis.com/company/values/\" rel=\"noopener noreferrer\">company values</a> that guide everything we do: Live for Customer Value, The Best Team Wins, We Own It, and Earth Is Our Future</li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>About Us:</strong></p>\n<p>Celonis helps some of the world’s largest and most esteemed brands make processes work for people, companies and the planet. With over 5,000 enterprise customer deployments across nearly every industry, the Celonis Process Intelligence Platform uses process mining and AI to give you a living digital twin of your business operation. It’s system-agnostic and without bias, and empowers companies to reduce waste, create value and benefit people across the top, bottom, and green lines. Since 2011, the Celonis platform has enabled its customers to identify more than $18 billion in value. Celonis is headquartered in Munich, Germany, and New York City, USA, with more than 20 offices worldwide.</p>\n<p>Get familiar with the Celonis Process Intelligence Platform by watching this <a href=\"https://academy.celonis.com/learn/video/discover-the-ems\" rel=\"noopener noreferrer\">video</a>.</p>\n<p>&nbsp;</p>\n<p><strong>Data Privacy, Equal Opportunity, and Accessibility Information</strong></p>\n<p>Celonis is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment and equal opportunity in all aspects of employment. We will not tolerate any unlawful discrimination or harassment of any kind. We make all employment decisions without regard to race/ethnicity, color, sex, pregnancy, age, sexual orientation, gender identity or expression, transgender status, national origin, citizenship status, religion, physical or mental disability, veteran status, or any other factor protected by applicable anti-discrimination laws. As a US federal contractor, we are committed to the principles of affirmative action in accordance with applicable laws and regulations.&nbsp;<a href=\"https://www.celonis.com/careers/diversity/\" rel=\"noopener noreferrer\">Different makes us better</a>.&nbsp;</p>\n<p>Any information you submit to Celonis as part of your application will be processed in accordance with Celonis’ <a href=\"https://www.celonis.com/careers/candidate-notices\" rel=\"noopener noreferrer\">&nbsp;Statements on Data Privacy, Equal Opportunity and Accessibility.</a></p>\n<p>Please be aware of common job offer scams, impersonators and frauds. Learn more <a href=\"https://www.celonis.com/careers/fraud-alert/\" rel=\"noopener noreferrer\">here</a>.</p>\n<p>By submitting this application, you confirm that you agree to the storing and processing of your personal data by Celonis as described in our <a href=\"https://www.celonis.com/careers/privacy-notice/\" rel=\"noopener noreferrer\">Privacy Notice for the Application and Hiring Process</a>.</p></div>",
      "name": "Account Executive- Swedish speaker",
      "type": "external",
      "publication_date": "2025-03-19T23:37:39Z",
      "short_name": "account-executive-swedish-speaker",
      "model_type": "jobs",
      "id": 18256005,
      "locations": [
        {
          "name": "Madrid, Spain"
        }
      ],
      "categories": [
        {
          "name": "Sales"
        }
      ],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/celonis/account-executive-swedish-speaker"
      },
      "company": {
        "id": 15000205,
        "short_name": "celonis",
        "name": "Celonis"
      }
    },
    {
      "contents": "<p>Overview: <p><strong><span>Role: Environmental Services Department Manager</span></strong></p><p>&nbsp;</p><p><span>Join Healthcare Services Group (HCSG) as an Account Manager, leading housekeeping, laundry, and floor care teams in a long-term care facility. At HCSG, we are passionate about positively impacting the communities we serve. If you share our commitment to excellence and enhancing customer and resident experiences, join us and make a difference!</span></p><h3><strong><span>What We Offer</span></strong></h3><ul><li><strong><span>Comprehensive Benefits Package - Medical, Dental, and Vision</span></strong></li></ul><ul><li><strong><span>Free Telemedicine Services on Day 1<em></span></strong></li></ul><ul><li><strong><span>Paid Holidays &amp; Vacation&nbsp;</span></strong></li></ul><ul><li><strong><span>401 (k)</span></strong></li></ul><ul><li><strong><span>Get paid when you need it with PNC EarnedIt</span></strong></li></ul><ul><li><strong><span>Financial Wellness Support from PNC Workplace Banking</span></strong></li></ul><ul><li><strong><span>Free Prescription Discount Program</span></strong></li></ul><ul><li><strong><span>Employee Assistance Programs</span></strong></li></ul><ul><li><strong><span>Training &amp; Development Opportunities</span></strong></li></ul><ul><li><strong><span>Employee Recognition Programs</span></strong></li></ul><ul><li><strong><span>Employee Stock Purchase Plan</span></strong></li></ul><ul><li><strong><span>Nationwide Transfer Opportunities</span></strong></li></ul><p><em><span></em>Not available in AR.</span></em></p><h3><strong><span>Responsibilities</span></strong></h3><p>&nbsp;</p><ul><li><span>Manage and supervise housekeeping, laundry, and floor care staff, ensuring compliance with policies, procedures, and federal/state requirements.</span></li><li><span>Perform and lead teams in light housekeeping, heavy housekeeping, and laundry aide duties across varying shifts.</span></li><li><span>Lead staff training, quality control, and in-service sessions; ensure timely completion of projects and programs.</span></li><li><span>Maintain records of income, expenditures, supplies, personnel, and equipment while using HCSG computer software.</span></li><li><span>Act as liaison between building occupants/administrators and HCSG staff; communicate directives effectively.</span></li><li><span>Use protective gear appropriately; ensure safe use of cleaning solutions and adherence to safety precautions.</span></li><li><span>Maintain consistent attendance, punctuality, and timely completion of tasks.</span></li><li><span>Represent HCSG positively through courteous interactions with supervisors, co-workers, client staff, residents, and guests.</span></li><li><span>All other duties as assigned.</span><span><br><br></span></li></ul><p><strong><span>Qualifications</span></strong></p><p>&nbsp;</p><ul><li><span>High school diploma or equivalent preferred.</span></li><li><span>Two years of experience in healthcare housekeeping and supervision preferred.</span></li><li><span>Maintain a positive attitude and effectively communicate with building occupants, administration, and HCSG leadership to perform daily tasks.</span></li><li><span>Compliance with COVID-19 vaccination policies.</span></li><li><span>Must be able to lift/carry a maximum of 50 pounds, push/pull a maximum of 50 pounds, stand, sit, bend and walk for extended periods.&nbsp;</span></li><li><span>Must be able to perform routine, repetitive tasks continuously.</span></li><li><span>Must be able to work around food and cleaning products.</span></li><li><span>Able to follow oral and written instructions, and perform routine, repetitive tasks daily.</span></li><li><span>Residency within the service area required.</span></li></ul><p>&nbsp;</p><p><strong><span>Ready to Join Us?</span></strong></p><p><span>If you're looking for a role where you can lead with passion, drive positive change, and be part of a supportive and dedicated team, apply now and start making a difference at HCSG!</span></p><p>&nbsp;</p><p><em><span>HCSG is proud to be an equal opportunity employer committed to diversity and inclusion in the workplace. We encourage employees to bring their authentic, original, and best selves to work for a culturally inclusive team. We offer equal employment opportunities (EEO) to all employees and applicants regardless of race, color, religion, sex, national origin, age, disability, genetics, ethnicity, pregnancy status, gender identity, sexual orientation, marital status, political opinions or affiliations, veteran status, or other legally protected classes. HCSG also complies with applicable state and local laws and federal law requirements that govern nondiscrimination in every location where we operate.</span></em></p></p>",
      "name": "Lead Housekpeeing Manager",
      "type": "external",
      "publication_date": "2025-07-11T09:56:00Z",
      "short_name": "lead-housekpeeing-manager-2c1fd5",
      "model_type": "jobs",
      "id": 19417366,
      "locations": [
        {
          "name": "Meridian, MS"
        }
      ],
      "categories": [],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/healthcareservicesgroupinc/lead-housekpeeing-manager-2c1fd5"
      },
      "company": {
        "id": 15000568,
        "short_name": "healthcareservicesgroupinc",
        "name": "Healthcare Services Group, Inc."
      }
    },
    {
      "contents": "<pre><code>                                                                    &lt;div&gt;\n        &lt;div&gt;\n            &lt;h3&gt;\n                                        &lt;i&gt;&lt;/i&gt;\n\n                Description &amp;amp; Requirements\n            &lt;/h3&gt;\n        &lt;/div&gt;\n\n\n    &lt;/div&gt;\n\n\n                &lt;div&gt;\n                    &lt;div&gt;\n                                                                                            &lt;div&gt;\n                                                                                &lt;div&gt;\n                                            Description\n                                        &lt;/div&gt;\n\n                                    &lt;div&gt;\n                                                                                        &lt;div&gt;\n</code></pre>\n<p><strong>Sign-On Bonus:&nbsp;</strong><strong>$750</strong><br/>\n</div><br/>\n<div><br></div><br/>\n<div><br/>\n<strong>Compensation: $26 - $32 Per Hour&nbsp;-</strong>&nbsp;Full time, based upon experience</div><br/>\n<div>Promotion opportunity to Program Supervisor (salaried) based upon experience</div><br/>\n<div><br></div><br/>\n<div><br/>\n<div><strong><u>Benefits of Working at Intercare:</u></strong></div><br/>\n<div><ul><br/>\n<li>Monthly Bonuses!</li><br/>\n<li>Flexible work schedule with a focus on work/life balance; Manage your own schedule</li><br/>\n<li>Mileage reimbursement, a company computer and cell phone</li><br/>\n<li>Education tuition reimbursement program (Masters &amp; BCBA)!</li><br/>\n<li>Leadership training and CEUs - we will teach how to become a better leader!</li><br/>\n<li>Medical, Dental, and Vision insurance</li><br/>\n<li>Generous time off policy (vacation, sick time, and holidays)</li><br/>\n<li>Company 401k Plan</li><br/>\n<li>Outstanding mentorship and supportive environment for continual learning</li><br/>\n</ul></div><br/>\n<div><strong><u>Required Credentials/Experience:</u></strong></div><br/>\n<div><ul><br/>\n<li>Completed Master’s degree in relevant field</li><br/>\n<li>In progress with BCBA preferred</li><br/>\n<li>Strong ABA, Program Management,&nbsp;and clinical skills</li><br/>\n<li>Excellent written and spoken communication, time management skills, and interpersonal skills</li><br/>\n<li>Ability to give and receive constructive feedback with a team player attitude</li><br/>\n<li>Bilingual skills valued</li><br/>\n</ul></div><br/>\n<div><strong><u>Job Description</u></strong></div><br/>\n<div>Intercare Therapy provides evidence-based behavioral therapies that help children overcome challenges related to autism spectrum disorders. Our mission is to optimize the independence and quality of life of our clients and their families. We love what we do, and we are seeking Behavioral Program Managers&nbsp;who share our passion for improving the lives of children and families affected by autism.</div><br/>\n<div><br></div><br/>\n<div>A Behavioral Health or (ABA)&nbsp;<strong>Program Manager&nbsp;</strong>serves in the field as the onsite case supervisor and leader, mastering daily case management skills, including developing and overseeing clinical programs, supervising BIs and providing education and training for client caregivers. You must be willing to drive 30 to 60 miles a day, and&nbsp;<u>able to supervise client sessions anytime between 8AM and 6PM on weekdays, and occasionally on weekends.</u><br/>\n</div><br/>\n<div><br></div><br/>\n<div><em>We are proud to be the highest rated established ABA organization on Glassdoor! Check out our rankings and reviews on Glassdoor!</em></div><br/>\n<div><em>Learn more about us on You Tube!</em></div><br/>\n<div><br></div><br/>\n<div>This position may require the candidate be fully vaccinated for COVID-19 in accordance with all vaccination requirements set forth by Intercare funding sources and pursuant to any guidelines from the California Department of Health.</div><br/>\n<div><br></div><br/>\n<div><strong><u>Closing:</u></strong></div><br/>\n<div>If you have experience in any of the following fields, we encourage you to apply:</div><br/>\n<div>Behavior Analyst, Autism, Social Learning, Social Skills, Developmental Condition, Psychology, Sociology, Social Services, Children, ABA, Applied behavior analysis, BCBA</div><br/>\n<div><br></div><br/>\n<div>Intercare Therapy will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.</div><br/>\n<div><em>Intercare Therapy supports a diverse workforce and is an Equal Opportunity Employer.</em></div><br/>\n</div><br/>\n                                                                                    </div><br/>\n                                    </div><br/>\n                                                                                    </div><br/>\n                    </div></p>",
      "name": "ABA Case Manager",
      "type": "external",
      "publication_date": "2025-07-12T09:56:59Z",
      "short_name": "aba-case-manager-04912b",
      "model_type": "jobs",
      "id": 18045750,
      "locations": [
        {
          "name": "Culver City, CA"
        }
      ],
      "categories": [
        {
          "name": "Education"
        }
      ],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/intercaretherapy/aba-case-manager-04912b"
      },
      "company": {
        "id": 15000799,
        "short_name": "intercaretherapy",
        "name": "Intercare Therapy"
      }
    }
  ],
  "aggregations": {}
}
